TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
       3                    ;* Date/Time created: Wed Dec 12 15:52:38 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../CC1350_LAUNCHXL_fxns.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\DAMIAN\TIVA_CC1350\sensor_cc1350lp\sensor_cc1350lp"
      13                    
      14                    ;*****************************************************************************

    1355                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1356                            .dwattr $C$DW$110, DW_AT_decl_line(0x5ed)
    1357                            .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1358                    
    1359                    $C$DW$111       .dwtag  DW_TAG_enumerator
    1360                            .dwattr $C$DW$111, DW_AT_name("RF_AllowDelayAny")
    1361                            .dwattr $C$DW$111, DW_AT_const_value(-1)
    1362                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1363                            .dwattr $C$DW$111, DW_AT_decl_line(0x5ee)
    1364                            .dwattr $C$DW$111, DW_AT_decl_column(0x05)
    1365                    
    1366                            .dwattr $C$DW$T$469, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    1367                            .dwattr $C$DW$T$469, DW_AT_decl_line(0x5ec)
    1368                            .dwattr $C$DW$T$469, DW_AT_decl_column(0x0e)
    1369                            .dwendtag $C$DW$T$469
    1370                    
    1371                    $C$DW$T$470     .dwtag  DW_TAG_typedef
    1372                            .dwattr $C$DW$T$470, DW_AT_name("RF_AllowDelay")
    1373                            .dwattr $C$DW$T$470, DW_AT_type(*$C$DW$T$469)
    1374                            .dwattr $C$DW$T$470, DW_AT_language(DW_LANG_C)
    1375                            .dwattr $C$DW$T$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   26

    1376                            .dwattr $C$DW$T$470, DW_AT_decl_line(0x5ef)
    1377                            .dwattr $C$DW$T$470, DW_AT_decl_column(0x03)
    1378                    
    1379                    
    1380                    $C$DW$T$471     .dwtag  DW_TAG_enumeration_type
    1381                            .dwattr $C$DW$T$471, DW_AT_byte_size(0x01)
    1382                    $C$DW$112       .dwtag  DW_TAG_enumerator
    1383                            .dwattr $C$DW$112, DW_AT_name("RF_RatChannelAny")
    1384                            .dwattr $C$DW$112, DW_AT_const_value(-1)
    1385                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1386                            .dwattr $C$DW$112, DW_AT_decl_line(0x60f)
    1387                            .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1388                    
    1389                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1390                            .dwattr $C$DW$113, DW_AT_name("RF_RatChannel0")
    1391                            .dwattr $C$DW$113, DW_AT_const_value(0x00)
    1392                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1393                            .dwattr $C$DW$113, DW_AT_decl_line(0x610)
    1394                            .dwattr $C$DW$113, DW_AT_decl_column(0x05)
    1395                    
    1396                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1397                            .dwattr $C$DW$114, DW_AT_name("RF_RatChannel1")
    1398                            .dwattr $C$DW$114, DW_AT_const_value(0x01)
    1399                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1400                            .dwattr $C$DW$114, DW_AT_decl_line(0x611)
    1401                            .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1402                    
    1403                    $C$DW$115       .dwtag  DW_TAG_enumerator
    1404                            .dwattr $C$DW$115, DW_AT_name("RF_RatChannel2")
    1405                            .dwattr $C$DW$115, DW_AT_const_value(0x02)
    1406                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1407                            .dwattr $C$DW$115, DW_AT_decl_line(0x612)
    1408                            .dwattr $C$DW$115, DW_AT_decl_column(0x05)
    1409                    
    1410                            .dwattr $C$DW$T$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    1411                            .dwattr $C$DW$T$471, DW_AT_decl_line(0x60e)
    1412                            .dwattr $C$DW$T$471, DW_AT_decl_column(0x0e)
    1413                            .dwendtag $C$DW$T$471
    1414                    
    1415                    $C$DW$T$472     .dwtag  DW_TAG_typedef
    1416                            .dwattr $C$DW$T$472, DW_AT_name("RF_RatSelectChannel")
    1417                            .dwattr $C$DW$T$472, DW_AT_type(*$C$DW$T$471)
    1418                            .dwattr $C$DW$T$472, DW_AT_language(DW_LANG_C)
    1419                            .dwattr $C$DW$T$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    1420                            .dwattr $C$DW$T$472, DW_AT_decl_line(0x613)
    1421                            .dwattr $C$DW$T$472, DW_AT_decl_column(0x03)
    1422                    
    1423                    
    1424                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1425                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    1426                    $C$DW$116       .dwtag  DW_TAG_member
    1427                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
    1428                            .dwattr $C$DW$116, DW_AT_name("rfMode")
    1429                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("rfMode")
    1430                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   27

    1431                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1432                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1433                            .dwattr $C$DW$116, DW_AT_decl_line(0x421)
    1434                            .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1435                    
    1436                    $C$DW$117       .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$24)
    1438                            .dwattr $C$DW$117, DW_AT_name("cpePatchFxn")
    1439                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("cpePatchFxn")
    1440                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1441                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1442                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1443                            .dwattr $C$DW$117, DW_AT_decl_line(0x422)
    1444                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    1445                    
    1446                    $C$DW$118       .dwtag  DW_TAG_member
    1447                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$24)
    1448                            .dwattr $C$DW$118, DW_AT_name("mcePatchFxn")
    1449                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("mcePatchFxn")
    1450                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1451                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1452                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1453                            .dwattr $C$DW$118, DW_AT_decl_line(0x423)
    1454                            .dwattr $C$DW$118, DW_AT_decl_column(0x0c)
    1455                    
    1456                    $C$DW$119       .dwtag  DW_TAG_member
    1457                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$24)
    1458                            .dwattr $C$DW$119, DW_AT_name("rfePatchFxn")
    1459                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("rfePatchFxn")
    1460                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1461                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1462                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    1463                            .dwattr $C$DW$119, DW_AT_decl_line(0x424)
    1464                            .dwattr $C$DW$119, DW_AT_decl_column(0x0c)
    1465                    
    1466                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    1467                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x420)
    1468                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1469                            .dwendtag $C$DW$T$25
    1470                    
    1471                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    1472                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    1473                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    1474                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1475                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    1476                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x425)
    1477                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    1478                    
    1479                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1480                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1481                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    1482                    
    1483                    
    1484                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1485                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   28

    1486                    $C$DW$120       .dwtag  DW_TAG_member
    1487                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$22)
    1488                            .dwattr $C$DW$120, DW_AT_name("triggerType")
    1489                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("triggerType")
    1490                            .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1491                            .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    1492                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1493                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1494                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1495                            .dwattr $C$DW$120, DW_AT_decl_line(0x7d)
    1496                            .dwattr $C$DW$120, DW_AT_decl_column(0x0f)
    1497                    
    1498                    $C$DW$121       .dwtag  DW_TAG_member
    1499                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$22)
    1500                            .dwattr $C$DW$121, DW_AT_name("bEnaCmd")
    1501                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("bEnaCmd")
    1502                            .dwattr $C$DW$121, DW_AT_bit_offset(0x03)
    1503                            .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1504                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1506                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1507                            .dwattr $C$DW$121, DW_AT_decl_line(0x7e)
    1508                            .dwattr $C$DW$121, DW_AT_decl_column(0x0f)
    1509                    
    1510                    $C$DW$122       .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$22)
    1512                            .dwattr $C$DW$122, DW_AT_name("triggerNo")
    1513                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("triggerNo")
    1514                            .dwattr $C$DW$122, DW_AT_bit_offset(0x01)
    1515                            .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    1516                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1519                            .dwattr $C$DW$122, DW_AT_decl_line(0x80)
    1520                            .dwattr $C$DW$122, DW_AT_decl_column(0x0f)
    1521                    
    1522                    $C$DW$123       .dwtag  DW_TAG_member
    1523                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$22)
    1524                            .dwattr $C$DW$123, DW_AT_name("pastTrig")
    1525                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("pastTrig")
    1526                            .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1527                            .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1528                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1530                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1531                            .dwattr $C$DW$123, DW_AT_decl_line(0x81)
    1532                            .dwattr $C$DW$123, DW_AT_decl_column(0x0f)
    1533                    
    1534                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1535                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    1536                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    1537                            .dwendtag $C$DW$T$26
    1538                    
    1539                    
    1540                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   29

    1541                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1542                    $C$DW$124       .dwtag  DW_TAG_member
    1543                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$22)
    1544                            .dwattr $C$DW$124, DW_AT_name("rule")
    1545                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rule")
    1546                            .dwattr $C$DW$124, DW_AT_bit_offset(0x04)
    1547                            .dwattr $C$DW$124, DW_AT_bit_size(0x04)
    1548                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1550                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1551                            .dwattr $C$DW$124, DW_AT_decl_line(0x85)
    1552                            .dwattr $C$DW$124, DW_AT_decl_column(0x0f)
    1553                    
    1554                    $C$DW$125       .dwtag  DW_TAG_member
    1555                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$22)
    1556                            .dwattr $C$DW$125, DW_AT_name("nSkip")
    1557                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("nSkip")
    1558                            .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1559                            .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1560                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1562                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1563                            .dwattr $C$DW$125, DW_AT_decl_line(0x86)
    1564                            .dwattr $C$DW$125, DW_AT_decl_column(0x0f)
    1565                    
    1566                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1567                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    1568                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    1569                            .dwendtag $C$DW$T$27
    1570                    
    1571                    
    1572                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1573                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1574                    $C$DW$126       .dwtag  DW_TAG_member
    1575                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$22)
    1576                            .dwattr $C$DW$126, DW_AT_name("triggerType")
    1577                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("triggerType")
    1578                            .dwattr $C$DW$126, DW_AT_bit_offset(0x04)
    1579                            .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    1580                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1582                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1583                            .dwattr $C$DW$126, DW_AT_decl_line(0xb3)
    1584                            .dwattr $C$DW$126, DW_AT_decl_column(0x0f)
    1585                    
    1586                    $C$DW$127       .dwtag  DW_TAG_member
    1587                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$22)
    1588                            .dwattr $C$DW$127, DW_AT_name("bEnaCmd")
    1589                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("bEnaCmd")
    1590                            .dwattr $C$DW$127, DW_AT_bit_offset(0x03)
    1591                            .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1592                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1594                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1595                            .dwattr $C$DW$127, DW_AT_decl_line(0xb4)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   30

    1596                            .dwattr $C$DW$127, DW_AT_decl_column(0x0f)
    1597                    
    1598                    $C$DW$128       .dwtag  DW_TAG_member
    1599                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$22)
    1600                            .dwattr $C$DW$128, DW_AT_name("triggerNo")
    1601                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("triggerNo")
    1602                            .dwattr $C$DW$128, DW_AT_bit_offset(0x01)
    1603                            .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1604                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1606                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1607                            .dwattr $C$DW$128, DW_AT_decl_line(0xb6)
    1608                            .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    1609                    
    1610                    $C$DW$129       .dwtag  DW_TAG_member
    1611                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    1612                            .dwattr $C$DW$129, DW_AT_name("pastTrig")
    1613                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("pastTrig")
    1614                            .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    1615                            .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1616                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1619                            .dwattr $C$DW$129, DW_AT_decl_line(0xb7)
    1620                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1621                    
    1622                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1623                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    1624                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    1625                            .dwendtag $C$DW$T$28
    1626                    
    1627                    
    1628                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1629                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1630                    $C$DW$130       .dwtag  DW_TAG_member
    1631                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    1632                            .dwattr $C$DW$130, DW_AT_name("rule")
    1633                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("rule")
    1634                            .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1635                            .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1636                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1638                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1639                            .dwattr $C$DW$130, DW_AT_decl_line(0xbb)
    1640                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    1641                    
    1642                    $C$DW$131       .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
    1644                            .dwattr $C$DW$131, DW_AT_name("nSkip")
    1645                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("nSkip")
    1646                            .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1647                            .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    1648                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1650                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   31

    1651                            .dwattr $C$DW$131, DW_AT_decl_line(0xbc)
    1652                            .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    1653                    
    1654                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1655                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    1656                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    1657                            .dwendtag $C$DW$T$29
    1658                    
    1659                    
    1660                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1661                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1662                    $C$DW$132       .dwtag  DW_TAG_member
    1663                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$31)
    1664                            .dwattr $C$DW$132, DW_AT_name("frontEndMode")
    1665                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("frontEndMode")
    1666                            .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    1667                            .dwattr $C$DW$132, DW_AT_bit_size(0x03)
    1668                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1670                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1671                            .dwattr $C$DW$132, DW_AT_decl_line(0xc9)
    1672                            .dwattr $C$DW$132, DW_AT_decl_column(0x10)
    1673                    
    1674                    $C$DW$133       .dwtag  DW_TAG_member
    1675                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$31)
    1676                            .dwattr $C$DW$133, DW_AT_name("biasMode")
    1677                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("biasMode")
    1678                            .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    1679                            .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1680                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1682                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1683                            .dwattr $C$DW$133, DW_AT_decl_line(0xcf)
    1684                            .dwattr $C$DW$133, DW_AT_decl_column(0x10)
    1685                    
    1686                    $C$DW$134       .dwtag  DW_TAG_member
    1687                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    1688                            .dwattr $C$DW$134, DW_AT_name("analogCfgMode")
    1689                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("analogCfgMode")
    1690                            .dwattr $C$DW$134, DW_AT_bit_offset(0x06)
    1691                            .dwattr $C$DW$134, DW_AT_bit_size(0x06)
    1692                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1694                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1695                            .dwattr $C$DW$134, DW_AT_decl_line(0xd1)
    1696                            .dwattr $C$DW$134, DW_AT_decl_column(0x10)
    1697                    
    1698                    $C$DW$135       .dwtag  DW_TAG_member
    1699                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$31)
    1700                            .dwattr $C$DW$135, DW_AT_name("bNoFsPowerUp")
    1701                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("bNoFsPowerUp")
    1702                            .dwattr $C$DW$135, DW_AT_bit_offset(0x05)
    1703                            .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1704                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   32

    1706                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1707                            .dwattr $C$DW$135, DW_AT_decl_line(0xd8)
    1708                            .dwattr $C$DW$135, DW_AT_decl_column(0x10)
    1709                    
    1710                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1711                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    1712                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    1713                            .dwendtag $C$DW$T$32
    1714                    
    1715                    
    1716                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1717                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1718                    $C$DW$136       .dwtag  DW_TAG_member
    1719                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    1720                            .dwattr $C$DW$136, DW_AT_name("triggerType")
    1721                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("triggerType")
    1722                            .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1723                            .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    1724                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1726                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1727                            .dwattr $C$DW$136, DW_AT_decl_line(0x1cf)
    1728                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    1729                    
    1730                    $C$DW$137       .dwtag  DW_TAG_member
    1731                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    1732                            .dwattr $C$DW$137, DW_AT_name("bEnaCmd")
    1733                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("bEnaCmd")
    1734                            .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    1735                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1736                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1738                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1739                            .dwattr $C$DW$137, DW_AT_decl_line(0x1d0)
    1740                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    1741                    
    1742                    $C$DW$138       .dwtag  DW_TAG_member
    1743                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    1744                            .dwattr $C$DW$138, DW_AT_name("triggerNo")
    1745                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("triggerNo")
    1746                            .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    1747                            .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    1748                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1750                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1751                            .dwattr $C$DW$138, DW_AT_decl_line(0x1d2)
    1752                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    1753                    
    1754                    $C$DW$139       .dwtag  DW_TAG_member
    1755                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$22)
    1756                            .dwattr $C$DW$139, DW_AT_name("pastTrig")
    1757                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("pastTrig")
    1758                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1759                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1760                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   33

    1761                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1762                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1763                            .dwattr $C$DW$139, DW_AT_decl_line(0x1d3)
    1764                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    1765                    
    1766                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1767                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    1768                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    1769                            .dwendtag $C$DW$T$33
    1770                    
    1771                    
    1772                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1773                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1774                    $C$DW$140       .dwtag  DW_TAG_member
    1775                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$22)
    1776                            .dwattr $C$DW$140, DW_AT_name("rule")
    1777                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("rule")
    1778                            .dwattr $C$DW$140, DW_AT_bit_offset(0x04)
    1779                            .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    1780                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1782                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1783                            .dwattr $C$DW$140, DW_AT_decl_line(0x1d7)
    1784                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    1785                    
    1786                    $C$DW$141       .dwtag  DW_TAG_member
    1787                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$22)
    1788                            .dwattr $C$DW$141, DW_AT_name("nSkip")
    1789                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("nSkip")
    1790                            .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    1791                            .dwattr $C$DW$141, DW_AT_bit_size(0x04)
    1792                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1794                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1795                            .dwattr $C$DW$141, DW_AT_decl_line(0x1d8)
    1796                            .dwattr $C$DW$141, DW_AT_decl_column(0x0f)
    1797                    
    1798                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1799                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    1800                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    1801                            .dwendtag $C$DW$T$34
    1802                    
    1803                    
    1804                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1805                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1806                    $C$DW$142       .dwtag  DW_TAG_member
    1807                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
    1808                            .dwattr $C$DW$142, DW_AT_name("modType")
    1809                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("modType")
    1810                            .dwattr $C$DW$142, DW_AT_bit_offset(0x0d)
    1811                            .dwattr $C$DW$142, DW_AT_bit_size(0x03)
    1812                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1814                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1815                            .dwattr $C$DW$142, DW_AT_decl_line(0x1db)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   34

    1816                            .dwattr $C$DW$142, DW_AT_decl_column(0x10)
    1817                    
    1818                    $C$DW$143       .dwtag  DW_TAG_member
    1819                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$31)
    1820                            .dwattr $C$DW$143, DW_AT_name("deviation")
    1821                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("deviation")
    1822                            .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    1823                            .dwattr $C$DW$143, DW_AT_bit_size(0x0d)
    1824                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1825                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1826                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1827                            .dwattr $C$DW$143, DW_AT_decl_line(0x1de)
    1828                            .dwattr $C$DW$143, DW_AT_decl_column(0x10)
    1829                    
    1830                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1831                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    1832                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    1833                            .dwendtag $C$DW$T$35
    1834                    
    1835                    
    1836                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1837                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1838                    $C$DW$144       .dwtag  DW_TAG_member
    1839                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$37)
    1840                            .dwattr $C$DW$144, DW_AT_name("preScale")
    1841                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("preScale")
    1842                            .dwattr $C$DW$144, DW_AT_bit_offset(0x1c)
    1843                            .dwattr $C$DW$144, DW_AT_bit_size(0x04)
    1844                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1845                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1846                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1847                            .dwattr $C$DW$144, DW_AT_decl_line(0x1e1)
    1848                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    1849                    
    1850                    $C$DW$145       .dwtag  DW_TAG_member
    1851                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$37)
    1852                            .dwattr $C$DW$145, DW_AT_name("rateWord")
    1853                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("rateWord")
    1854                            .dwattr $C$DW$145, DW_AT_bit_offset(0x03)
    1855                            .dwattr $C$DW$145, DW_AT_bit_size(0x15)
    1856                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1858                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1859                            .dwattr $C$DW$145, DW_AT_decl_line(0x1e3)
    1860                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    1861                    
    1862                    $C$DW$146       .dwtag  DW_TAG_member
    1863                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$37)
    1864                            .dwattr $C$DW$146, DW_AT_name("decimMode")
    1865                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("decimMode")
    1866                            .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    1867                            .dwattr $C$DW$146, DW_AT_bit_size(0x03)
    1868                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1870                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   35

    1871                            .dwattr $C$DW$146, DW_AT_decl_line(0x1e4)
    1872                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    1873                    
    1874                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1875                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    1876                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    1877                            .dwendtag $C$DW$T$38
    1878                    
    1879                    
    1880                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1881                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1882                    $C$DW$147       .dwtag  DW_TAG_member
    1883                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    1884                            .dwattr $C$DW$147, DW_AT_name("nPreamBytes")
    1885                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("nPreamBytes")
    1886                            .dwattr $C$DW$147, DW_AT_bit_offset(0x02)
    1887                            .dwattr $C$DW$147, DW_AT_bit_size(0x06)
    1888                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1890                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1891                            .dwattr $C$DW$147, DW_AT_decl_line(0x1ec)
    1892                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    1893                    
    1894                    $C$DW$148       .dwtag  DW_TAG_member
    1895                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    1896                            .dwattr $C$DW$148, DW_AT_name("preamMode")
    1897                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("preamMode")
    1898                            .dwattr $C$DW$148, DW_AT_bit_offset(0x00)
    1899                            .dwattr $C$DW$148, DW_AT_bit_size(0x02)
    1900                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1902                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1903                            .dwattr $C$DW$148, DW_AT_decl_line(0x1f2)
    1904                            .dwattr $C$DW$148, DW_AT_decl_column(0x0f)
    1905                    
    1906                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1907                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    1908                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    1909                            .dwendtag $C$DW$T$39
    1910                    
    1911                    
    1912                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1913                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1914                    $C$DW$149       .dwtag  DW_TAG_member
    1915                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1916                            .dwattr $C$DW$149, DW_AT_name("nSwBits")
    1917                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("nSwBits")
    1918                            .dwattr $C$DW$149, DW_AT_bit_offset(0x0a)
    1919                            .dwattr $C$DW$149, DW_AT_bit_size(0x06)
    1920                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1922                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1923                            .dwattr $C$DW$149, DW_AT_decl_line(0x1f8)
    1924                            .dwattr $C$DW$149, DW_AT_decl_column(0x10)
    1925                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   36

    1926                    $C$DW$150       .dwtag  DW_TAG_member
    1927                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    1928                            .dwattr $C$DW$150, DW_AT_name("bBitReversal")
    1929                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("bBitReversal")
    1930                            .dwattr $C$DW$150, DW_AT_bit_offset(0x09)
    1931                            .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1932                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1934                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1935                            .dwattr $C$DW$150, DW_AT_decl_line(0x1f9)
    1936                            .dwattr $C$DW$150, DW_AT_decl_column(0x10)
    1937                    
    1938                    $C$DW$151       .dwtag  DW_TAG_member
    1939                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    1940                            .dwattr $C$DW$151, DW_AT_name("bMsbFirst")
    1941                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("bMsbFirst")
    1942                            .dwattr $C$DW$151, DW_AT_bit_offset(0x08)
    1943                            .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1944                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1946                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1947                            .dwattr $C$DW$151, DW_AT_decl_line(0x1fb)
    1948                            .dwattr $C$DW$151, DW_AT_decl_column(0x10)
    1949                    
    1950                    $C$DW$152       .dwtag  DW_TAG_member
    1951                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1952                            .dwattr $C$DW$152, DW_AT_name("fecMode")
    1953                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("fecMode")
    1954                            .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    1955                            .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    1956                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1958                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1959                            .dwattr $C$DW$152, DW_AT_decl_line(0x1fd)
    1960                            .dwattr $C$DW$152, DW_AT_decl_column(0x10)
    1961                    
    1962                    $C$DW$153       .dwtag  DW_TAG_member
    1963                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1964                            .dwattr $C$DW$153, DW_AT_name("whitenMode")
    1965                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("whitenMode")
    1966                            .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    1967                            .dwattr $C$DW$153, DW_AT_bit_size(0x03)
    1968                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1970                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1971                            .dwattr $C$DW$153, DW_AT_decl_line(0x203)
    1972                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    1973                    
    1974                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1975                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
    1976                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    1977                            .dwendtag $C$DW$T$40
    1978                    
    1979                    
    1980                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   37

    1981                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1982                    $C$DW$154       .dwtag  DW_TAG_member
    1983                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1984                            .dwattr $C$DW$154, DW_AT_name("frontEndMode")
    1985                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("frontEndMode")
    1986                            .dwattr $C$DW$154, DW_AT_bit_offset(0x0d)
    1987                            .dwattr $C$DW$154, DW_AT_bit_size(0x03)
    1988                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1990                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1991                            .dwattr $C$DW$154, DW_AT_decl_line(0x20d)
    1992                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    1993                    
    1994                    $C$DW$155       .dwtag  DW_TAG_member
    1995                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
    1996                            .dwattr $C$DW$155, DW_AT_name("biasMode")
    1997                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("biasMode")
    1998                            .dwattr $C$DW$155, DW_AT_bit_offset(0x0c)
    1999                            .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2000                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2002                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2003                            .dwattr $C$DW$155, DW_AT_decl_line(0x213)
    2004                            .dwattr $C$DW$155, DW_AT_decl_column(0x10)
    2005                    
    2006                    $C$DW$156       .dwtag  DW_TAG_member
    2007                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    2008                            .dwattr $C$DW$156, DW_AT_name("analogCfgMode")
    2009                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("analogCfgMode")
    2010                            .dwattr $C$DW$156, DW_AT_bit_offset(0x06)
    2011                            .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2012                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2014                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2015                            .dwattr $C$DW$156, DW_AT_decl_line(0x215)
    2016                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    2017                    
    2018                    $C$DW$157       .dwtag  DW_TAG_member
    2019                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    2020                            .dwattr $C$DW$157, DW_AT_name("bNoFsPowerUp")
    2021                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2022                            .dwattr $C$DW$157, DW_AT_bit_offset(0x05)
    2023                            .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2024                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2026                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2027                            .dwattr $C$DW$157, DW_AT_decl_line(0x21c)
    2028                            .dwattr $C$DW$157, DW_AT_decl_column(0x10)
    2029                    
    2030                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2031                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    2032                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    2033                            .dwendtag $C$DW$T$41
    2034                    
    2035                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   38

    2036                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2037                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2038                    $C$DW$158       .dwtag  DW_TAG_member
    2039                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    2040                            .dwattr $C$DW$158, DW_AT_name("triggerType")
    2041                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("triggerType")
    2042                            .dwattr $C$DW$158, DW_AT_bit_offset(0x04)
    2043                            .dwattr $C$DW$158, DW_AT_bit_size(0x04)
    2044                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2046                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2047                            .dwattr $C$DW$158, DW_AT_decl_line(0x232)
    2048                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    2049                    
    2050                    $C$DW$159       .dwtag  DW_TAG_member
    2051                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
    2052                            .dwattr $C$DW$159, DW_AT_name("bEnaCmd")
    2053                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("bEnaCmd")
    2054                            .dwattr $C$DW$159, DW_AT_bit_offset(0x03)
    2055                            .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2056                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2058                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2059                            .dwattr $C$DW$159, DW_AT_decl_line(0x233)
    2060                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    2061                    
    2062                    $C$DW$160       .dwtag  DW_TAG_member
    2063                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
    2064                            .dwattr $C$DW$160, DW_AT_name("triggerNo")
    2065                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("triggerNo")
    2066                            .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2067                            .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2068                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2070                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2071                            .dwattr $C$DW$160, DW_AT_decl_line(0x235)
    2072                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    2073                    
    2074                    $C$DW$161       .dwtag  DW_TAG_member
    2075                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
    2076                            .dwattr $C$DW$161, DW_AT_name("pastTrig")
    2077                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pastTrig")
    2078                            .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2079                            .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2080                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2082                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2083                            .dwattr $C$DW$161, DW_AT_decl_line(0x236)
    2084                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    2085                    
    2086                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2087                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    2088                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    2089                            .dwendtag $C$DW$T$42
    2090                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   39

    2091                    
    2092                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2093                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2094                    $C$DW$162       .dwtag  DW_TAG_member
    2095                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    2096                            .dwattr $C$DW$162, DW_AT_name("rule")
    2097                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rule")
    2098                            .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    2099                            .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    2100                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2102                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2103                            .dwattr $C$DW$162, DW_AT_decl_line(0x23a)
    2104                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    2105                    
    2106                    $C$DW$163       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    2108                            .dwattr $C$DW$163, DW_AT_name("nSkip")
    2109                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("nSkip")
    2110                            .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2111                            .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2112                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2114                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2115                            .dwattr $C$DW$163, DW_AT_decl_line(0x23b)
    2116                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    2117                    
    2118                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2119                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    2120                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    2121                            .dwendtag $C$DW$T$43
    2122                    
    2123                    
    2124                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2125                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2126                    $C$DW$164       .dwtag  DW_TAG_member
    2127                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    2128                            .dwattr $C$DW$164, DW_AT_name("modType")
    2129                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("modType")
    2130                            .dwattr $C$DW$164, DW_AT_bit_offset(0x0d)
    2131                            .dwattr $C$DW$164, DW_AT_bit_size(0x03)
    2132                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2134                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2135                            .dwattr $C$DW$164, DW_AT_decl_line(0x23e)
    2136                            .dwattr $C$DW$164, DW_AT_decl_column(0x10)
    2137                    
    2138                    $C$DW$165       .dwtag  DW_TAG_member
    2139                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    2140                            .dwattr $C$DW$165, DW_AT_name("deviation")
    2141                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("deviation")
    2142                            .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    2143                            .dwattr $C$DW$165, DW_AT_bit_size(0x0d)
    2144                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   40

    2146                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2147                            .dwattr $C$DW$165, DW_AT_decl_line(0x241)
    2148                            .dwattr $C$DW$165, DW_AT_decl_column(0x10)
    2149                    
    2150                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2151                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    2152                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    2153                            .dwendtag $C$DW$T$44
    2154                    
    2155                    
    2156                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2157                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    2158                    $C$DW$166       .dwtag  DW_TAG_member
    2159                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$37)
    2160                            .dwattr $C$DW$166, DW_AT_name("preScale")
    2161                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("preScale")
    2162                            .dwattr $C$DW$166, DW_AT_bit_offset(0x1c)
    2163                            .dwattr $C$DW$166, DW_AT_bit_size(0x04)
    2164                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2166                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2167                            .dwattr $C$DW$166, DW_AT_decl_line(0x244)
    2168                            .dwattr $C$DW$166, DW_AT_decl_column(0x10)
    2169                    
    2170                    $C$DW$167       .dwtag  DW_TAG_member
    2171                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$37)
    2172                            .dwattr $C$DW$167, DW_AT_name("rateWord")
    2173                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("rateWord")
    2174                            .dwattr $C$DW$167, DW_AT_bit_offset(0x03)
    2175                            .dwattr $C$DW$167, DW_AT_bit_size(0x15)
    2176                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2178                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2179                            .dwattr $C$DW$167, DW_AT_decl_line(0x246)
    2180                            .dwattr $C$DW$167, DW_AT_decl_column(0x10)
    2181                    
    2182                    $C$DW$168       .dwtag  DW_TAG_member
    2183                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$37)
    2184                            .dwattr $C$DW$168, DW_AT_name("decimMode")
    2185                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("decimMode")
    2186                            .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2187                            .dwattr $C$DW$168, DW_AT_bit_size(0x03)
    2188                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2191                            .dwattr $C$DW$168, DW_AT_decl_line(0x247)
    2192                            .dwattr $C$DW$168, DW_AT_decl_column(0x10)
    2193                    
    2194                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2195                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
    2196                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    2197                            .dwendtag $C$DW$T$45
    2198                    
    2199                    
    2200                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   41

    2201                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2202                    $C$DW$169       .dwtag  DW_TAG_member
    2203                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    2204                            .dwattr $C$DW$169, DW_AT_name("nPreamBytes")
    2205                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("nPreamBytes")
    2206                            .dwattr $C$DW$169, DW_AT_bit_offset(0x02)
    2207                            .dwattr $C$DW$169, DW_AT_bit_size(0x06)
    2208                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2210                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2211                            .dwattr $C$DW$169, DW_AT_decl_line(0x24f)
    2212                            .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
    2213                    
    2214                    $C$DW$170       .dwtag  DW_TAG_member
    2215                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2216                            .dwattr $C$DW$170, DW_AT_name("preamMode")
    2217                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("preamMode")
    2218                            .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2219                            .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    2220                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2222                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2223                            .dwattr $C$DW$170, DW_AT_decl_line(0x255)
    2224                            .dwattr $C$DW$170, DW_AT_decl_column(0x0f)
    2225                    
    2226                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2227                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    2228                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    2229                            .dwendtag $C$DW$T$46
    2230                    
    2231                    
    2232                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2233                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2234                    $C$DW$171       .dwtag  DW_TAG_member
    2235                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    2236                            .dwattr $C$DW$171, DW_AT_name("nSwBits")
    2237                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nSwBits")
    2238                            .dwattr $C$DW$171, DW_AT_bit_offset(0x0a)
    2239                            .dwattr $C$DW$171, DW_AT_bit_size(0x06)
    2240                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2241                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2243                            .dwattr $C$DW$171, DW_AT_decl_line(0x25b)
    2244                            .dwattr $C$DW$171, DW_AT_decl_column(0x10)
    2245                    
    2246                    $C$DW$172       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    2248                            .dwattr $C$DW$172, DW_AT_name("bBitReversal")
    2249                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("bBitReversal")
    2250                            .dwattr $C$DW$172, DW_AT_bit_offset(0x09)
    2251                            .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2252                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2253                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2254                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2255                            .dwattr $C$DW$172, DW_AT_decl_line(0x25c)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   42

    2256                            .dwattr $C$DW$172, DW_AT_decl_column(0x10)
    2257                    
    2258                    $C$DW$173       .dwtag  DW_TAG_member
    2259                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    2260                            .dwattr $C$DW$173, DW_AT_name("bMsbFirst")
    2261                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("bMsbFirst")
    2262                            .dwattr $C$DW$173, DW_AT_bit_offset(0x08)
    2263                            .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2264                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2266                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2267                            .dwattr $C$DW$173, DW_AT_decl_line(0x25e)
    2268                            .dwattr $C$DW$173, DW_AT_decl_column(0x10)
    2269                    
    2270                    $C$DW$174       .dwtag  DW_TAG_member
    2271                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    2272                            .dwattr $C$DW$174, DW_AT_name("fecMode")
    2273                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("fecMode")
    2274                            .dwattr $C$DW$174, DW_AT_bit_offset(0x04)
    2275                            .dwattr $C$DW$174, DW_AT_bit_size(0x04)
    2276                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2277                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2278                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2279                            .dwattr $C$DW$174, DW_AT_decl_line(0x260)
    2280                            .dwattr $C$DW$174, DW_AT_decl_column(0x10)
    2281                    
    2282                    $C$DW$175       .dwtag  DW_TAG_member
    2283                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    2284                            .dwattr $C$DW$175, DW_AT_name("whitenMode")
    2285                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("whitenMode")
    2286                            .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2287                            .dwattr $C$DW$175, DW_AT_bit_size(0x03)
    2288                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2289                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2290                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2291                            .dwattr $C$DW$175, DW_AT_decl_line(0x266)
    2292                            .dwattr $C$DW$175, DW_AT_decl_column(0x10)
    2293                    
    2294                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2295                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    2296                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    2297                            .dwendtag $C$DW$T$47
    2298                    
    2299                    
    2300                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2301                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2302                    $C$DW$176       .dwtag  DW_TAG_member
    2303                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    2304                            .dwattr $C$DW$176, DW_AT_name("frontEndMode")
    2305                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("frontEndMode")
    2306                            .dwattr $C$DW$176, DW_AT_bit_offset(0x0d)
    2307                            .dwattr $C$DW$176, DW_AT_bit_size(0x03)
    2308                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2310                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   43

    2311                            .dwattr $C$DW$176, DW_AT_decl_line(0x270)
    2312                            .dwattr $C$DW$176, DW_AT_decl_column(0x10)
    2313                    
    2314                    $C$DW$177       .dwtag  DW_TAG_member
    2315                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    2316                            .dwattr $C$DW$177, DW_AT_name("biasMode")
    2317                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("biasMode")
    2318                            .dwattr $C$DW$177, DW_AT_bit_offset(0x0c)
    2319                            .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2320                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2322                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2323                            .dwattr $C$DW$177, DW_AT_decl_line(0x276)
    2324                            .dwattr $C$DW$177, DW_AT_decl_column(0x10)
    2325                    
    2326                    $C$DW$178       .dwtag  DW_TAG_member
    2327                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    2328                            .dwattr $C$DW$178, DW_AT_name("analogCfgMode")
    2329                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("analogCfgMode")
    2330                            .dwattr $C$DW$178, DW_AT_bit_offset(0x06)
    2331                            .dwattr $C$DW$178, DW_AT_bit_size(0x06)
    2332                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2333                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2334                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2335                            .dwattr $C$DW$178, DW_AT_decl_line(0x278)
    2336                            .dwattr $C$DW$178, DW_AT_decl_column(0x10)
    2337                    
    2338                    $C$DW$179       .dwtag  DW_TAG_member
    2339                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    2340                            .dwattr $C$DW$179, DW_AT_name("bNoFsPowerUp")
    2341                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2342                            .dwattr $C$DW$179, DW_AT_bit_offset(0x05)
    2343                            .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2344                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2346                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2347                            .dwattr $C$DW$179, DW_AT_decl_line(0x27f)
    2348                            .dwattr $C$DW$179, DW_AT_decl_column(0x10)
    2349                    
    2350                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2351                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    2352                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    2353                            .dwendtag $C$DW$T$48
    2354                    
    2355                    
    2356                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2357                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    2358                    $C$DW$180       .dwtag  DW_TAG_member
    2359                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$37)
    2360                            .dwattr $C$DW$180, DW_AT_name("nInactivityTimeout")
    2361                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("nInactivityTimeout")
    2362                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2364                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2365                            .dwattr $C$DW$180, DW_AT_decl_line(0x515)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   44

    2366                            .dwattr $C$DW$180, DW_AT_decl_column(0x1d)
    2367                    
    2368                    $C$DW$181       .dwtag  DW_TAG_member
    2369                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$50)
    2370                            .dwattr $C$DW$181, DW_AT_name("pRfMode")
    2371                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("pRfMode")
    2372                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2373                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2374                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2375                            .dwattr $C$DW$181, DW_AT_decl_line(0x516)
    2376                            .dwattr $C$DW$181, DW_AT_decl_column(0x1d)
    2377                    
    2378                    $C$DW$182       .dwtag  DW_TAG_member
    2379                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$52)
    2380                            .dwattr $C$DW$182, DW_AT_name("pRadioSetup")
    2381                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("pRadioSetup")
    2382                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2383                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2385                            .dwattr $C$DW$182, DW_AT_decl_line(0x517)
    2386                            .dwattr $C$DW$182, DW_AT_decl_column(0x1d)
    2387                    
    2388                    $C$DW$183       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$37)
    2390                            .dwattr $C$DW$183, DW_AT_name("nPowerUpDuration")
    2391                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("nPowerUpDuration")
    2392                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2393                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2395                            .dwattr $C$DW$183, DW_AT_decl_line(0x518)
    2396                            .dwattr $C$DW$183, DW_AT_decl_column(0x1d)
    2397                    
    2398                    $C$DW$184       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$53)
    2400                            .dwattr $C$DW$184, DW_AT_name("bMeasurePowerUpDuration")
    2401                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    2402                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2403                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2405                            .dwattr $C$DW$184, DW_AT_decl_line(0x519)
    2406                            .dwattr $C$DW$184, DW_AT_decl_column(0x1d)
    2407                    
    2408                    $C$DW$185       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$53)
    2410                            .dwattr $C$DW$185, DW_AT_name("bUpdateSetup")
    2411                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("bUpdateSetup")
    2412                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2413                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2414                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2415                            .dwattr $C$DW$185, DW_AT_decl_line(0x51a)
    2416                            .dwattr $C$DW$185, DW_AT_decl_column(0x1d)
    2417                    
    2418                    $C$DW$186       .dwtag  DW_TAG_member
    2419                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    2420                            .dwattr $C$DW$186, DW_AT_name("nPowerUpDurationMargin")
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   45

    2421                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    2422                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2423                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2424                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2425                            .dwattr $C$DW$186, DW_AT_decl_line(0x51b)
    2426                            .dwattr $C$DW$186, DW_AT_decl_column(0x1d)
    2427                    
    2428                    $C$DW$187       .dwtag  DW_TAG_member
    2429                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$3)
    2430                            .dwattr $C$DW$187, DW_AT_name("pPowerCb")
    2431                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("pPowerCb")
    2432                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2433                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2434                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2435                            .dwattr $C$DW$187, DW_AT_decl_line(0x51c)
    2436                            .dwattr $C$DW$187, DW_AT_decl_column(0x1d)
    2437                    
    2438                    $C$DW$188       .dwtag  DW_TAG_member
    2439                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$3)
    2440                            .dwattr $C$DW$188, DW_AT_name("pErrCb")
    2441                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("pErrCb")
    2442                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2443                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2444                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2445                            .dwattr $C$DW$188, DW_AT_decl_line(0x51d)
    2446                            .dwattr $C$DW$188, DW_AT_decl_column(0x1d)
    2447                    
    2448                    $C$DW$189       .dwtag  DW_TAG_member
    2449                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$3)
    2450                            .dwattr $C$DW$189, DW_AT_name("pClientEventCb")
    2451                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("pClientEventCb")
    2452                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2453                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2454                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2455                            .dwattr $C$DW$189, DW_AT_decl_line(0x51e)
    2456                            .dwattr $C$DW$189, DW_AT_decl_column(0x1d)
    2457                    
    2458                    $C$DW$190       .dwtag  DW_TAG_member
    2459                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$54)
    2460                            .dwattr $C$DW$190, DW_AT_name("nClientEventMask")
    2461                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("nClientEventMask")
    2462                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2463                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2464                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2465                            .dwattr $C$DW$190, DW_AT_decl_line(0x51f)
    2466                            .dwattr $C$DW$190, DW_AT_decl_column(0x1d)
    2467                    
    2468                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2469                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x514)
    2470                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
    2471                            .dwendtag $C$DW$T$55
    2472                    
    2473                    
    2474                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2475                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   46

    2476                    $C$DW$191       .dwtag  DW_TAG_member
    2477                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2478                            .dwattr $C$DW$191, DW_AT_name("triggerType")
    2479                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("triggerType")
    2480                            .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
    2481                            .dwattr $C$DW$191, DW_AT_bit_size(0x04)
    2482                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2484                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2485                            .dwattr $C$DW$191, DW_AT_decl_line(0xee)
    2486                            .dwattr $C$DW$191, DW_AT_decl_column(0x0f)
    2487                    
    2488                    $C$DW$192       .dwtag  DW_TAG_member
    2489                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2490                            .dwattr $C$DW$192, DW_AT_name("bEnaCmd")
    2491                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("bEnaCmd")
    2492                            .dwattr $C$DW$192, DW_AT_bit_offset(0x03)
    2493                            .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2494                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2495                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2496                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2497                            .dwattr $C$DW$192, DW_AT_decl_line(0xef)
    2498                            .dwattr $C$DW$192, DW_AT_decl_column(0x0f)
    2499                    
    2500                    $C$DW$193       .dwtag  DW_TAG_member
    2501                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2502                            .dwattr $C$DW$193, DW_AT_name("triggerNo")
    2503                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("triggerNo")
    2504                            .dwattr $C$DW$193, DW_AT_bit_offset(0x01)
    2505                            .dwattr $C$DW$193, DW_AT_bit_size(0x02)
    2506                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2507                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2509                            .dwattr $C$DW$193, DW_AT_decl_line(0xf1)
    2510                            .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    2511                    
    2512                    $C$DW$194       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2514                            .dwattr $C$DW$194, DW_AT_name("pastTrig")
    2515                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pastTrig")
    2516                            .dwattr $C$DW$194, DW_AT_bit_offset(0x00)
    2517                            .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2518                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2519                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2520                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2521                            .dwattr $C$DW$194, DW_AT_decl_line(0xf2)
    2522                            .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    2523                    
    2524                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2525                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
    2526                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    2527                            .dwendtag $C$DW$T$56
    2528                    
    2529                    
    2530                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.4 Wed Dec 12 15:52:38 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{119C5F4A-D102-4424-9FB0-E2E41B533519} PAGE   47

    2531                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    2532                    $C$DW$195       .dwtag  DW_TAG_member
    2533                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
