TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
       3                    ;* Date/Time created: Wed Dec 12 16:09:00 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/CC1350_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\DAMIAN\TIVA_CC1350\sensor_cc1350lp\sensor_cc1350lp"
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    2335                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2336                            .dwattr $C$DW$145, DW_AT_decl_line(0x5ed)
    2337                            .dwattr $C$DW$145, DW_AT_decl_column(0x05)
    2338                    
    2339                    $C$DW$146       .dwtag  DW_TAG_enumerator
    2340                            .dwattr $C$DW$146, DW_AT_name("RF_AllowDelayAny")
    2341                            .dwattr $C$DW$146, DW_AT_const_value(-1)
    2342                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2343                            .dwattr $C$DW$146, DW_AT_decl_line(0x5ee)
    2344                            .dwattr $C$DW$146, DW_AT_decl_column(0x05)
    2345                    
    2346                            .dwattr $C$DW$T$1075, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    2347                            .dwattr $C$DW$T$1075, DW_AT_decl_line(0x5ec)
    2348                            .dwattr $C$DW$T$1075, DW_AT_decl_column(0x0e)
    2349                            .dwendtag $C$DW$T$1075
    2350                    
    2351                    $C$DW$T$1076    .dwtag  DW_TAG_typedef
    2352                            .dwattr $C$DW$T$1076, DW_AT_name("RF_AllowDelay")
    2353                            .dwattr $C$DW$T$1076, DW_AT_type(*$C$DW$T$1075)
    2354                            .dwattr $C$DW$T$1076, DW_AT_language(DW_LANG_C)
    2355                            .dwattr $C$DW$T$1076, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    2356                            .dwattr $C$DW$T$1076, DW_AT_decl_line(0x5ef)
    2357                            .dwattr $C$DW$T$1076, DW_AT_decl_column(0x03)
    2358                    
    2359                    
    2360                    $C$DW$T$1077    .dwtag  DW_TAG_enumeration_type
    2361                            .dwattr $C$DW$T$1077, DW_AT_byte_size(0x01)
    2362                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2363                            .dwattr $C$DW$147, DW_AT_name("RF_RatChannelAny")
    2364                            .dwattr $C$DW$147, DW_AT_const_value(-1)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   44

    2365                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2366                            .dwattr $C$DW$147, DW_AT_decl_line(0x60f)
    2367                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2368                    
    2369                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2370                            .dwattr $C$DW$148, DW_AT_name("RF_RatChannel0")
    2371                            .dwattr $C$DW$148, DW_AT_const_value(0x00)
    2372                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2373                            .dwattr $C$DW$148, DW_AT_decl_line(0x610)
    2374                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2375                    
    2376                    $C$DW$149       .dwtag  DW_TAG_enumerator
    2377                            .dwattr $C$DW$149, DW_AT_name("RF_RatChannel1")
    2378                            .dwattr $C$DW$149, DW_AT_const_value(0x01)
    2379                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2380                            .dwattr $C$DW$149, DW_AT_decl_line(0x611)
    2381                            .dwattr $C$DW$149, DW_AT_decl_column(0x05)
    2382                    
    2383                    $C$DW$150       .dwtag  DW_TAG_enumerator
    2384                            .dwattr $C$DW$150, DW_AT_name("RF_RatChannel2")
    2385                            .dwattr $C$DW$150, DW_AT_const_value(0x02)
    2386                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2387                            .dwattr $C$DW$150, DW_AT_decl_line(0x612)
    2388                            .dwattr $C$DW$150, DW_AT_decl_column(0x05)
    2389                    
    2390                            .dwattr $C$DW$T$1077, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    2391                            .dwattr $C$DW$T$1077, DW_AT_decl_line(0x60e)
    2392                            .dwattr $C$DW$T$1077, DW_AT_decl_column(0x0e)
    2393                            .dwendtag $C$DW$T$1077
    2394                    
    2395                    $C$DW$T$1078    .dwtag  DW_TAG_typedef
    2396                            .dwattr $C$DW$T$1078, DW_AT_name("RF_RatSelectChannel")
    2397                            .dwattr $C$DW$T$1078, DW_AT_type(*$C$DW$T$1077)
    2398                            .dwattr $C$DW$T$1078, DW_AT_language(DW_LANG_C)
    2399                            .dwattr $C$DW$T$1078, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    2400                            .dwattr $C$DW$T$1078, DW_AT_decl_line(0x613)
    2401                            .dwattr $C$DW$T$1078, DW_AT_decl_column(0x03)
    2402                    
    2403                    
    2404                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2405                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    2406                    $C$DW$151       .dwtag  DW_TAG_member
    2407                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    2408                            .dwattr $C$DW$151, DW_AT_name("rfMode")
    2409                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("rfMode")
    2410                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2412                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2413                            .dwattr $C$DW$151, DW_AT_decl_line(0x421)
    2414                            .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2415                    
    2416                    $C$DW$152       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$25)
    2418                            .dwattr $C$DW$152, DW_AT_name("cpePatchFxn")
    2419                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("cpePatchFxn")
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   45

    2420                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2421                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2423                            .dwattr $C$DW$152, DW_AT_decl_line(0x422)
    2424                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    2425                    
    2426                    $C$DW$153       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$25)
    2428                            .dwattr $C$DW$153, DW_AT_name("mcePatchFxn")
    2429                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("mcePatchFxn")
    2430                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2431                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2433                            .dwattr $C$DW$153, DW_AT_decl_line(0x423)
    2434                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    2435                    
    2436                    $C$DW$154       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$25)
    2438                            .dwattr $C$DW$154, DW_AT_name("rfePatchFxn")
    2439                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("rfePatchFxn")
    2440                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2441                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2443                            .dwattr $C$DW$154, DW_AT_decl_line(0x424)
    2444                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    2445                    
    2446                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2447                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x420)
    2448                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2449                            .dwendtag $C$DW$T$26
    2450                    
    2451                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2452                            .dwattr $C$DW$T$50, DW_AT_name("RF_Mode")
    2453                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$26)
    2454                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2455                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2456                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x425)
    2457                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    2458                    
    2459                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2460                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2461                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    2462                    
    2463                    
    2464                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2465                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2466                    $C$DW$155       .dwtag  DW_TAG_member
    2467                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    2468                            .dwattr $C$DW$155, DW_AT_name("triggerType")
    2469                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("triggerType")
    2470                            .dwattr $C$DW$155, DW_AT_bit_offset(0x04)
    2471                            .dwattr $C$DW$155, DW_AT_bit_size(0x04)
    2472                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2474                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   46

    2475                            .dwattr $C$DW$155, DW_AT_decl_line(0x7d)
    2476                            .dwattr $C$DW$155, DW_AT_decl_column(0x0f)
    2477                    
    2478                    $C$DW$156       .dwtag  DW_TAG_member
    2479                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    2480                            .dwattr $C$DW$156, DW_AT_name("bEnaCmd")
    2481                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("bEnaCmd")
    2482                            .dwattr $C$DW$156, DW_AT_bit_offset(0x03)
    2483                            .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2484                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2485                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2486                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2487                            .dwattr $C$DW$156, DW_AT_decl_line(0x7e)
    2488                            .dwattr $C$DW$156, DW_AT_decl_column(0x0f)
    2489                    
    2490                    $C$DW$157       .dwtag  DW_TAG_member
    2491                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    2492                            .dwattr $C$DW$157, DW_AT_name("triggerNo")
    2493                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("triggerNo")
    2494                            .dwattr $C$DW$157, DW_AT_bit_offset(0x01)
    2495                            .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2496                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2498                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2499                            .dwattr $C$DW$157, DW_AT_decl_line(0x80)
    2500                            .dwattr $C$DW$157, DW_AT_decl_column(0x0f)
    2501                    
    2502                    $C$DW$158       .dwtag  DW_TAG_member
    2503                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    2504                            .dwattr $C$DW$158, DW_AT_name("pastTrig")
    2505                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("pastTrig")
    2506                            .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    2507                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2508                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2510                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2511                            .dwattr $C$DW$158, DW_AT_decl_line(0x81)
    2512                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    2513                    
    2514                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2515                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x7c)
    2516                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    2517                            .dwendtag $C$DW$T$27
    2518                    
    2519                    
    2520                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2521                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2522                    $C$DW$159       .dwtag  DW_TAG_member
    2523                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    2524                            .dwattr $C$DW$159, DW_AT_name("rule")
    2525                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("rule")
    2526                            .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    2527                            .dwattr $C$DW$159, DW_AT_bit_size(0x04)
    2528                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2529                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   47

    2530                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2531                            .dwattr $C$DW$159, DW_AT_decl_line(0x85)
    2532                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    2533                    
    2534                    $C$DW$160       .dwtag  DW_TAG_member
    2535                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
    2536                            .dwattr $C$DW$160, DW_AT_name("nSkip")
    2537                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("nSkip")
    2538                            .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    2539                            .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    2540                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2542                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2543                            .dwattr $C$DW$160, DW_AT_decl_line(0x86)
    2544                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    2545                    
    2546                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2547                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x84)
    2548                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    2549                            .dwendtag $C$DW$T$28
    2550                    
    2551                    
    2552                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2553                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2554                    $C$DW$161       .dwtag  DW_TAG_member
    2555                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
    2556                            .dwattr $C$DW$161, DW_AT_name("triggerType")
    2557                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("triggerType")
    2558                            .dwattr $C$DW$161, DW_AT_bit_offset(0x04)
    2559                            .dwattr $C$DW$161, DW_AT_bit_size(0x04)
    2560                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2561                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2562                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2563                            .dwattr $C$DW$161, DW_AT_decl_line(0xb3)
    2564                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    2565                    
    2566                    $C$DW$162       .dwtag  DW_TAG_member
    2567                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    2568                            .dwattr $C$DW$162, DW_AT_name("bEnaCmd")
    2569                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("bEnaCmd")
    2570                            .dwattr $C$DW$162, DW_AT_bit_offset(0x03)
    2571                            .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2572                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2575                            .dwattr $C$DW$162, DW_AT_decl_line(0xb4)
    2576                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    2577                    
    2578                    $C$DW$163       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    2580                            .dwattr $C$DW$163, DW_AT_name("triggerNo")
    2581                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("triggerNo")
    2582                            .dwattr $C$DW$163, DW_AT_bit_offset(0x01)
    2583                            .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    2584                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   48

    2585                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2586                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2587                            .dwattr $C$DW$163, DW_AT_decl_line(0xb6)
    2588                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    2589                    
    2590                    $C$DW$164       .dwtag  DW_TAG_member
    2591                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    2592                            .dwattr $C$DW$164, DW_AT_name("pastTrig")
    2593                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("pastTrig")
    2594                            .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    2595                            .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2596                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2597                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2598                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2599                            .dwattr $C$DW$164, DW_AT_decl_line(0xb7)
    2600                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2601                    
    2602                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2603                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xb2)
    2604                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    2605                            .dwendtag $C$DW$T$29
    2606                    
    2607                    
    2608                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2609                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2610                    $C$DW$165       .dwtag  DW_TAG_member
    2611                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2612                            .dwattr $C$DW$165, DW_AT_name("rule")
    2613                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("rule")
    2614                            .dwattr $C$DW$165, DW_AT_bit_offset(0x04)
    2615                            .dwattr $C$DW$165, DW_AT_bit_size(0x04)
    2616                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2618                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2619                            .dwattr $C$DW$165, DW_AT_decl_line(0xbb)
    2620                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    2621                    
    2622                    $C$DW$166       .dwtag  DW_TAG_member
    2623                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
    2624                            .dwattr $C$DW$166, DW_AT_name("nSkip")
    2625                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("nSkip")
    2626                            .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2627                            .dwattr $C$DW$166, DW_AT_bit_size(0x04)
    2628                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2631                            .dwattr $C$DW$166, DW_AT_decl_line(0xbc)
    2632                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    2633                    
    2634                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2635                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xba)
    2636                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    2637                            .dwendtag $C$DW$T$30
    2638                    
    2639                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   49

    2640                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2641                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2642                    $C$DW$167       .dwtag  DW_TAG_member
    2643                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    2644                            .dwattr $C$DW$167, DW_AT_name("frontEndMode")
    2645                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("frontEndMode")
    2646                            .dwattr $C$DW$167, DW_AT_bit_offset(0x0d)
    2647                            .dwattr $C$DW$167, DW_AT_bit_size(0x03)
    2648                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2650                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2651                            .dwattr $C$DW$167, DW_AT_decl_line(0xc9)
    2652                            .dwattr $C$DW$167, DW_AT_decl_column(0x10)
    2653                    
    2654                    $C$DW$168       .dwtag  DW_TAG_member
    2655                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$32)
    2656                            .dwattr $C$DW$168, DW_AT_name("biasMode")
    2657                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("biasMode")
    2658                            .dwattr $C$DW$168, DW_AT_bit_offset(0x0c)
    2659                            .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2660                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2662                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2663                            .dwattr $C$DW$168, DW_AT_decl_line(0xcf)
    2664                            .dwattr $C$DW$168, DW_AT_decl_column(0x10)
    2665                    
    2666                    $C$DW$169       .dwtag  DW_TAG_member
    2667                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    2668                            .dwattr $C$DW$169, DW_AT_name("analogCfgMode")
    2669                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("analogCfgMode")
    2670                            .dwattr $C$DW$169, DW_AT_bit_offset(0x06)
    2671                            .dwattr $C$DW$169, DW_AT_bit_size(0x06)
    2672                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2674                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2675                            .dwattr $C$DW$169, DW_AT_decl_line(0xd1)
    2676                            .dwattr $C$DW$169, DW_AT_decl_column(0x10)
    2677                    
    2678                    $C$DW$170       .dwtag  DW_TAG_member
    2679                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$32)
    2680                            .dwattr $C$DW$170, DW_AT_name("bNoFsPowerUp")
    2681                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2682                            .dwattr $C$DW$170, DW_AT_bit_offset(0x05)
    2683                            .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2684                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2686                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2687                            .dwattr $C$DW$170, DW_AT_decl_line(0xd8)
    2688                            .dwattr $C$DW$170, DW_AT_decl_column(0x10)
    2689                    
    2690                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2691                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xc8)
    2692                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    2693                            .dwendtag $C$DW$T$33
    2694                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   50

    2695                    
    2696                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2697                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2698                    $C$DW$171       .dwtag  DW_TAG_member
    2699                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2700                            .dwattr $C$DW$171, DW_AT_name("triggerType")
    2701                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("triggerType")
    2702                            .dwattr $C$DW$171, DW_AT_bit_offset(0x04)
    2703                            .dwattr $C$DW$171, DW_AT_bit_size(0x04)
    2704                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2706                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2707                            .dwattr $C$DW$171, DW_AT_decl_line(0x1cf)
    2708                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    2709                    
    2710                    $C$DW$172       .dwtag  DW_TAG_member
    2711                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    2712                            .dwattr $C$DW$172, DW_AT_name("bEnaCmd")
    2713                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("bEnaCmd")
    2714                            .dwattr $C$DW$172, DW_AT_bit_offset(0x03)
    2715                            .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2716                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2717                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2718                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2719                            .dwattr $C$DW$172, DW_AT_decl_line(0x1d0)
    2720                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    2721                    
    2722                    $C$DW$173       .dwtag  DW_TAG_member
    2723                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    2724                            .dwattr $C$DW$173, DW_AT_name("triggerNo")
    2725                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("triggerNo")
    2726                            .dwattr $C$DW$173, DW_AT_bit_offset(0x01)
    2727                            .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2728                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2729                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2730                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2731                            .dwattr $C$DW$173, DW_AT_decl_line(0x1d2)
    2732                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    2733                    
    2734                    $C$DW$174       .dwtag  DW_TAG_member
    2735                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2736                            .dwattr $C$DW$174, DW_AT_name("pastTrig")
    2737                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("pastTrig")
    2738                            .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2739                            .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2740                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2742                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2743                            .dwattr $C$DW$174, DW_AT_decl_line(0x1d3)
    2744                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    2745                    
    2746                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2747                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1ce)
    2748                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    2749                            .dwendtag $C$DW$T$34
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   51

    2750                    
    2751                    
    2752                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2753                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2754                    $C$DW$175       .dwtag  DW_TAG_member
    2755                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2756                            .dwattr $C$DW$175, DW_AT_name("rule")
    2757                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("rule")
    2758                            .dwattr $C$DW$175, DW_AT_bit_offset(0x04)
    2759                            .dwattr $C$DW$175, DW_AT_bit_size(0x04)
    2760                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2762                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2763                            .dwattr $C$DW$175, DW_AT_decl_line(0x1d7)
    2764                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    2765                    
    2766                    $C$DW$176       .dwtag  DW_TAG_member
    2767                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
    2768                            .dwattr $C$DW$176, DW_AT_name("nSkip")
    2769                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nSkip")
    2770                            .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2771                            .dwattr $C$DW$176, DW_AT_bit_size(0x04)
    2772                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2773                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2774                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2775                            .dwattr $C$DW$176, DW_AT_decl_line(0x1d8)
    2776                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    2777                    
    2778                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2779                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1d6)
    2780                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    2781                            .dwendtag $C$DW$T$35
    2782                    
    2783                    
    2784                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2785                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2786                    $C$DW$177       .dwtag  DW_TAG_member
    2787                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    2788                            .dwattr $C$DW$177, DW_AT_name("modType")
    2789                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("modType")
    2790                            .dwattr $C$DW$177, DW_AT_bit_offset(0x0d)
    2791                            .dwattr $C$DW$177, DW_AT_bit_size(0x03)
    2792                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2793                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2794                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2795                            .dwattr $C$DW$177, DW_AT_decl_line(0x1db)
    2796                            .dwattr $C$DW$177, DW_AT_decl_column(0x10)
    2797                    
    2798                    $C$DW$178       .dwtag  DW_TAG_member
    2799                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
    2800                            .dwattr $C$DW$178, DW_AT_name("deviation")
    2801                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("deviation")
    2802                            .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2803                            .dwattr $C$DW$178, DW_AT_bit_size(0x0d)
    2804                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   52

    2805                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2806                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2807                            .dwattr $C$DW$178, DW_AT_decl_line(0x1de)
    2808                            .dwattr $C$DW$178, DW_AT_decl_column(0x10)
    2809                    
    2810                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2811                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1da)
    2812                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    2813                            .dwendtag $C$DW$T$36
    2814                    
    2815                    
    2816                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2817                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2818                    $C$DW$179       .dwtag  DW_TAG_member
    2819                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$38)
    2820                            .dwattr $C$DW$179, DW_AT_name("preScale")
    2821                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("preScale")
    2822                            .dwattr $C$DW$179, DW_AT_bit_offset(0x1c)
    2823                            .dwattr $C$DW$179, DW_AT_bit_size(0x04)
    2824                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2826                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2827                            .dwattr $C$DW$179, DW_AT_decl_line(0x1e1)
    2828                            .dwattr $C$DW$179, DW_AT_decl_column(0x10)
    2829                    
    2830                    $C$DW$180       .dwtag  DW_TAG_member
    2831                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$38)
    2832                            .dwattr $C$DW$180, DW_AT_name("rateWord")
    2833                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("rateWord")
    2834                            .dwattr $C$DW$180, DW_AT_bit_offset(0x03)
    2835                            .dwattr $C$DW$180, DW_AT_bit_size(0x15)
    2836                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2838                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2839                            .dwattr $C$DW$180, DW_AT_decl_line(0x1e3)
    2840                            .dwattr $C$DW$180, DW_AT_decl_column(0x10)
    2841                    
    2842                    $C$DW$181       .dwtag  DW_TAG_member
    2843                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$38)
    2844                            .dwattr $C$DW$181, DW_AT_name("decimMode")
    2845                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("decimMode")
    2846                            .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    2847                            .dwattr $C$DW$181, DW_AT_bit_size(0x03)
    2848                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2849                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2850                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2851                            .dwattr $C$DW$181, DW_AT_decl_line(0x1e4)
    2852                            .dwattr $C$DW$181, DW_AT_decl_column(0x10)
    2853                    
    2854                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2855                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1e0)
    2856                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    2857                            .dwendtag $C$DW$T$39
    2858                    
    2859                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   53

    2860                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2861                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2862                    $C$DW$182       .dwtag  DW_TAG_member
    2863                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$23)
    2864                            .dwattr $C$DW$182, DW_AT_name("nPreamBytes")
    2865                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("nPreamBytes")
    2866                            .dwattr $C$DW$182, DW_AT_bit_offset(0x02)
    2867                            .dwattr $C$DW$182, DW_AT_bit_size(0x06)
    2868                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2870                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2871                            .dwattr $C$DW$182, DW_AT_decl_line(0x1ec)
    2872                            .dwattr $C$DW$182, DW_AT_decl_column(0x0f)
    2873                    
    2874                    $C$DW$183       .dwtag  DW_TAG_member
    2875                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$23)
    2876                            .dwattr $C$DW$183, DW_AT_name("preamMode")
    2877                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("preamMode")
    2878                            .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2879                            .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    2880                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2882                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2883                            .dwattr $C$DW$183, DW_AT_decl_line(0x1f2)
    2884                            .dwattr $C$DW$183, DW_AT_decl_column(0x0f)
    2885                    
    2886                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2887                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1eb)
    2888                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    2889                            .dwendtag $C$DW$T$40
    2890                    
    2891                    
    2892                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2893                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2894                    $C$DW$184       .dwtag  DW_TAG_member
    2895                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$32)
    2896                            .dwattr $C$DW$184, DW_AT_name("nSwBits")
    2897                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("nSwBits")
    2898                            .dwattr $C$DW$184, DW_AT_bit_offset(0x0a)
    2899                            .dwattr $C$DW$184, DW_AT_bit_size(0x06)
    2900                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2902                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2903                            .dwattr $C$DW$184, DW_AT_decl_line(0x1f8)
    2904                            .dwattr $C$DW$184, DW_AT_decl_column(0x10)
    2905                    
    2906                    $C$DW$185       .dwtag  DW_TAG_member
    2907                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    2908                            .dwattr $C$DW$185, DW_AT_name("bBitReversal")
    2909                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("bBitReversal")
    2910                            .dwattr $C$DW$185, DW_AT_bit_offset(0x09)
    2911                            .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2912                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2913                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2914                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   54

    2915                            .dwattr $C$DW$185, DW_AT_decl_line(0x1f9)
    2916                            .dwattr $C$DW$185, DW_AT_decl_column(0x10)
    2917                    
    2918                    $C$DW$186       .dwtag  DW_TAG_member
    2919                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    2920                            .dwattr $C$DW$186, DW_AT_name("bMsbFirst")
    2921                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("bMsbFirst")
    2922                            .dwattr $C$DW$186, DW_AT_bit_offset(0x08)
    2923                            .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2924                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2925                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2926                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2927                            .dwattr $C$DW$186, DW_AT_decl_line(0x1fb)
    2928                            .dwattr $C$DW$186, DW_AT_decl_column(0x10)
    2929                    
    2930                    $C$DW$187       .dwtag  DW_TAG_member
    2931                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    2932                            .dwattr $C$DW$187, DW_AT_name("fecMode")
    2933                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("fecMode")
    2934                            .dwattr $C$DW$187, DW_AT_bit_offset(0x04)
    2935                            .dwattr $C$DW$187, DW_AT_bit_size(0x04)
    2936                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2937                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2938                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2939                            .dwattr $C$DW$187, DW_AT_decl_line(0x1fd)
    2940                            .dwattr $C$DW$187, DW_AT_decl_column(0x10)
    2941                    
    2942                    $C$DW$188       .dwtag  DW_TAG_member
    2943                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$32)
    2944                            .dwattr $C$DW$188, DW_AT_name("whitenMode")
    2945                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("whitenMode")
    2946                            .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    2947                            .dwattr $C$DW$188, DW_AT_bit_size(0x03)
    2948                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2949                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2950                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2951                            .dwattr $C$DW$188, DW_AT_decl_line(0x203)
    2952                            .dwattr $C$DW$188, DW_AT_decl_column(0x10)
    2953                    
    2954                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2955                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x1f7)
    2956                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    2957                            .dwendtag $C$DW$T$41
    2958                    
    2959                    
    2960                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2961                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2962                    $C$DW$189       .dwtag  DW_TAG_member
    2963                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    2964                            .dwattr $C$DW$189, DW_AT_name("frontEndMode")
    2965                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("frontEndMode")
    2966                            .dwattr $C$DW$189, DW_AT_bit_offset(0x0d)
    2967                            .dwattr $C$DW$189, DW_AT_bit_size(0x03)
    2968                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   55

    2970                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2971                            .dwattr $C$DW$189, DW_AT_decl_line(0x20d)
    2972                            .dwattr $C$DW$189, DW_AT_decl_column(0x10)
    2973                    
    2974                    $C$DW$190       .dwtag  DW_TAG_member
    2975                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$32)
    2976                            .dwattr $C$DW$190, DW_AT_name("biasMode")
    2977                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("biasMode")
    2978                            .dwattr $C$DW$190, DW_AT_bit_offset(0x0c)
    2979                            .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2980                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2981                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2982                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2983                            .dwattr $C$DW$190, DW_AT_decl_line(0x213)
    2984                            .dwattr $C$DW$190, DW_AT_decl_column(0x10)
    2985                    
    2986                    $C$DW$191       .dwtag  DW_TAG_member
    2987                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$32)
    2988                            .dwattr $C$DW$191, DW_AT_name("analogCfgMode")
    2989                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("analogCfgMode")
    2990                            .dwattr $C$DW$191, DW_AT_bit_offset(0x06)
    2991                            .dwattr $C$DW$191, DW_AT_bit_size(0x06)
    2992                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2994                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2995                            .dwattr $C$DW$191, DW_AT_decl_line(0x215)
    2996                            .dwattr $C$DW$191, DW_AT_decl_column(0x10)
    2997                    
    2998                    $C$DW$192       .dwtag  DW_TAG_member
    2999                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$32)
    3000                            .dwattr $C$DW$192, DW_AT_name("bNoFsPowerUp")
    3001                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3002                            .dwattr $C$DW$192, DW_AT_bit_offset(0x05)
    3003                            .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3004                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3005                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3006                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3007                            .dwattr $C$DW$192, DW_AT_decl_line(0x21c)
    3008                            .dwattr $C$DW$192, DW_AT_decl_column(0x10)
    3009                    
    3010                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3011                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x20c)
    3012                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3013                            .dwendtag $C$DW$T$42
    3014                    
    3015                    
    3016                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3017                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3018                    $C$DW$193       .dwtag  DW_TAG_member
    3019                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
    3020                            .dwattr $C$DW$193, DW_AT_name("triggerType")
    3021                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("triggerType")
    3022                            .dwattr $C$DW$193, DW_AT_bit_offset(0x04)
    3023                            .dwattr $C$DW$193, DW_AT_bit_size(0x04)
    3024                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   56

    3025                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3026                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3027                            .dwattr $C$DW$193, DW_AT_decl_line(0x232)
    3028                            .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    3029                    
    3030                    $C$DW$194       .dwtag  DW_TAG_member
    3031                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$23)
    3032                            .dwattr $C$DW$194, DW_AT_name("bEnaCmd")
    3033                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("bEnaCmd")
    3034                            .dwattr $C$DW$194, DW_AT_bit_offset(0x03)
    3035                            .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3036                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3037                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3038                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3039                            .dwattr $C$DW$194, DW_AT_decl_line(0x233)
    3040                            .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    3041                    
    3042                    $C$DW$195       .dwtag  DW_TAG_member
    3043                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$23)
    3044                            .dwattr $C$DW$195, DW_AT_name("triggerNo")
    3045                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("triggerNo")
    3046                            .dwattr $C$DW$195, DW_AT_bit_offset(0x01)
    3047                            .dwattr $C$DW$195, DW_AT_bit_size(0x02)
    3048                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3050                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3051                            .dwattr $C$DW$195, DW_AT_decl_line(0x235)
    3052                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    3053                    
    3054                    $C$DW$196       .dwtag  DW_TAG_member
    3055                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
    3056                            .dwattr $C$DW$196, DW_AT_name("pastTrig")
    3057                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("pastTrig")
    3058                            .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    3059                            .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    3060                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3062                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3063                            .dwattr $C$DW$196, DW_AT_decl_line(0x236)
    3064                            .dwattr $C$DW$196, DW_AT_decl_column(0x0f)
    3065                    
    3066                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3067                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x231)
    3068                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    3069                            .dwendtag $C$DW$T$43
    3070                    
    3071                    
    3072                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3073                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3074                    $C$DW$197       .dwtag  DW_TAG_member
    3075                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$23)
    3076                            .dwattr $C$DW$197, DW_AT_name("rule")
    3077                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("rule")
    3078                            .dwattr $C$DW$197, DW_AT_bit_offset(0x04)
    3079                            .dwattr $C$DW$197, DW_AT_bit_size(0x04)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   57

    3080                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3081                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3083                            .dwattr $C$DW$197, DW_AT_decl_line(0x23a)
    3084                            .dwattr $C$DW$197, DW_AT_decl_column(0x0f)
    3085                    
    3086                    $C$DW$198       .dwtag  DW_TAG_member
    3087                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    3088                            .dwattr $C$DW$198, DW_AT_name("nSkip")
    3089                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("nSkip")
    3090                            .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    3091                            .dwattr $C$DW$198, DW_AT_bit_size(0x04)
    3092                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3093                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3094                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3095                            .dwattr $C$DW$198, DW_AT_decl_line(0x23b)
    3096                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    3097                    
    3098                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3099                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x239)
    3100                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    3101                            .dwendtag $C$DW$T$44
    3102                    
    3103                    
    3104                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3105                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3106                    $C$DW$199       .dwtag  DW_TAG_member
    3107                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$32)
    3108                            .dwattr $C$DW$199, DW_AT_name("modType")
    3109                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("modType")
    3110                            .dwattr $C$DW$199, DW_AT_bit_offset(0x0d)
    3111                            .dwattr $C$DW$199, DW_AT_bit_size(0x03)
    3112                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3113                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3114                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3115                            .dwattr $C$DW$199, DW_AT_decl_line(0x23e)
    3116                            .dwattr $C$DW$199, DW_AT_decl_column(0x10)
    3117                    
    3118                    $C$DW$200       .dwtag  DW_TAG_member
    3119                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$32)
    3120                            .dwattr $C$DW$200, DW_AT_name("deviation")
    3121                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("deviation")
    3122                            .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    3123                            .dwattr $C$DW$200, DW_AT_bit_size(0x0d)
    3124                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3126                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3127                            .dwattr $C$DW$200, DW_AT_decl_line(0x241)
    3128                            .dwattr $C$DW$200, DW_AT_decl_column(0x10)
    3129                    
    3130                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3131                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x23d)
    3132                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    3133                            .dwendtag $C$DW$T$45
    3134                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   58

    3135                    
    3136                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3137                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    3138                    $C$DW$201       .dwtag  DW_TAG_member
    3139                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$38)
    3140                            .dwattr $C$DW$201, DW_AT_name("preScale")
    3141                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("preScale")
    3142                            .dwattr $C$DW$201, DW_AT_bit_offset(0x1c)
    3143                            .dwattr $C$DW$201, DW_AT_bit_size(0x04)
    3144                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3145                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3146                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3147                            .dwattr $C$DW$201, DW_AT_decl_line(0x244)
    3148                            .dwattr $C$DW$201, DW_AT_decl_column(0x10)
    3149                    
    3150                    $C$DW$202       .dwtag  DW_TAG_member
    3151                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$38)
    3152                            .dwattr $C$DW$202, DW_AT_name("rateWord")
    3153                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("rateWord")
    3154                            .dwattr $C$DW$202, DW_AT_bit_offset(0x03)
    3155                            .dwattr $C$DW$202, DW_AT_bit_size(0x15)
    3156                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3157                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3158                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3159                            .dwattr $C$DW$202, DW_AT_decl_line(0x246)
    3160                            .dwattr $C$DW$202, DW_AT_decl_column(0x10)
    3161                    
    3162                    $C$DW$203       .dwtag  DW_TAG_member
    3163                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    3164                            .dwattr $C$DW$203, DW_AT_name("decimMode")
    3165                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("decimMode")
    3166                            .dwattr $C$DW$203, DW_AT_bit_offset(0x00)
    3167                            .dwattr $C$DW$203, DW_AT_bit_size(0x03)
    3168                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3169                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3170                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3171                            .dwattr $C$DW$203, DW_AT_decl_line(0x247)
    3172                            .dwattr $C$DW$203, DW_AT_decl_column(0x10)
    3173                    
    3174                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3175                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x243)
    3176                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    3177                            .dwendtag $C$DW$T$46
    3178                    
    3179                    
    3180                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3181                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3182                    $C$DW$204       .dwtag  DW_TAG_member
    3183                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$23)
    3184                            .dwattr $C$DW$204, DW_AT_name("nPreamBytes")
    3185                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("nPreamBytes")
    3186                            .dwattr $C$DW$204, DW_AT_bit_offset(0x02)
    3187                            .dwattr $C$DW$204, DW_AT_bit_size(0x06)
    3188                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3189                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   59

    3190                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3191                            .dwattr $C$DW$204, DW_AT_decl_line(0x24f)
    3192                            .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
    3193                    
    3194                    $C$DW$205       .dwtag  DW_TAG_member
    3195                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$23)
    3196                            .dwattr $C$DW$205, DW_AT_name("preamMode")
    3197                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("preamMode")
    3198                            .dwattr $C$DW$205, DW_AT_bit_offset(0x00)
    3199                            .dwattr $C$DW$205, DW_AT_bit_size(0x02)
    3200                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3201                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3202                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3203                            .dwattr $C$DW$205, DW_AT_decl_line(0x255)
    3204                            .dwattr $C$DW$205, DW_AT_decl_column(0x0f)
    3205                    
    3206                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3207                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x24e)
    3208                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    3209                            .dwendtag $C$DW$T$47
    3210                    
    3211                    
    3212                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3213                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3214                    $C$DW$206       .dwtag  DW_TAG_member
    3215                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    3216                            .dwattr $C$DW$206, DW_AT_name("nSwBits")
    3217                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("nSwBits")
    3218                            .dwattr $C$DW$206, DW_AT_bit_offset(0x0a)
    3219                            .dwattr $C$DW$206, DW_AT_bit_size(0x06)
    3220                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3221                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3222                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3223                            .dwattr $C$DW$206, DW_AT_decl_line(0x25b)
    3224                            .dwattr $C$DW$206, DW_AT_decl_column(0x10)
    3225                    
    3226                    $C$DW$207       .dwtag  DW_TAG_member
    3227                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$32)
    3228                            .dwattr $C$DW$207, DW_AT_name("bBitReversal")
    3229                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("bBitReversal")
    3230                            .dwattr $C$DW$207, DW_AT_bit_offset(0x09)
    3231                            .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    3232                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3233                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3234                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3235                            .dwattr $C$DW$207, DW_AT_decl_line(0x25c)
    3236                            .dwattr $C$DW$207, DW_AT_decl_column(0x10)
    3237                    
    3238                    $C$DW$208       .dwtag  DW_TAG_member
    3239                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$32)
    3240                            .dwattr $C$DW$208, DW_AT_name("bMsbFirst")
    3241                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("bMsbFirst")
    3242                            .dwattr $C$DW$208, DW_AT_bit_offset(0x08)
    3243                            .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    3244                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   60

    3245                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3246                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3247                            .dwattr $C$DW$208, DW_AT_decl_line(0x25e)
    3248                            .dwattr $C$DW$208, DW_AT_decl_column(0x10)
    3249                    
    3250                    $C$DW$209       .dwtag  DW_TAG_member
    3251                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    3252                            .dwattr $C$DW$209, DW_AT_name("fecMode")
    3253                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("fecMode")
    3254                            .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    3255                            .dwattr $C$DW$209, DW_AT_bit_size(0x04)
    3256                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3257                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3258                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3259                            .dwattr $C$DW$209, DW_AT_decl_line(0x260)
    3260                            .dwattr $C$DW$209, DW_AT_decl_column(0x10)
    3261                    
    3262                    $C$DW$210       .dwtag  DW_TAG_member
    3263                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$32)
    3264                            .dwattr $C$DW$210, DW_AT_name("whitenMode")
    3265                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("whitenMode")
    3266                            .dwattr $C$DW$210, DW_AT_bit_offset(0x00)
    3267                            .dwattr $C$DW$210, DW_AT_bit_size(0x03)
    3268                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3269                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3270                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3271                            .dwattr $C$DW$210, DW_AT_decl_line(0x266)
    3272                            .dwattr $C$DW$210, DW_AT_decl_column(0x10)
    3273                    
    3274                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3275                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x25a)
    3276                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    3277                            .dwendtag $C$DW$T$48
    3278                    
    3279                    
    3280                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3281                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3282                    $C$DW$211       .dwtag  DW_TAG_member
    3283                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$32)
    3284                            .dwattr $C$DW$211, DW_AT_name("frontEndMode")
    3285                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("frontEndMode")
    3286                            .dwattr $C$DW$211, DW_AT_bit_offset(0x0d)
    3287                            .dwattr $C$DW$211, DW_AT_bit_size(0x03)
    3288                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3289                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3290                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3291                            .dwattr $C$DW$211, DW_AT_decl_line(0x270)
    3292                            .dwattr $C$DW$211, DW_AT_decl_column(0x10)
    3293                    
    3294                    $C$DW$212       .dwtag  DW_TAG_member
    3295                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$32)
    3296                            .dwattr $C$DW$212, DW_AT_name("biasMode")
    3297                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("biasMode")
    3298                            .dwattr $C$DW$212, DW_AT_bit_offset(0x0c)
    3299                            .dwattr $C$DW$212, DW_AT_bit_size(0x01)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   61

    3300                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3301                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3302                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3303                            .dwattr $C$DW$212, DW_AT_decl_line(0x276)
    3304                            .dwattr $C$DW$212, DW_AT_decl_column(0x10)
    3305                    
    3306                    $C$DW$213       .dwtag  DW_TAG_member
    3307                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$32)
    3308                            .dwattr $C$DW$213, DW_AT_name("analogCfgMode")
    3309                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("analogCfgMode")
    3310                            .dwattr $C$DW$213, DW_AT_bit_offset(0x06)
    3311                            .dwattr $C$DW$213, DW_AT_bit_size(0x06)
    3312                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3313                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3314                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3315                            .dwattr $C$DW$213, DW_AT_decl_line(0x278)
    3316                            .dwattr $C$DW$213, DW_AT_decl_column(0x10)
    3317                    
    3318                    $C$DW$214       .dwtag  DW_TAG_member
    3319                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$32)
    3320                            .dwattr $C$DW$214, DW_AT_name("bNoFsPowerUp")
    3321                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3322                            .dwattr $C$DW$214, DW_AT_bit_offset(0x05)
    3323                            .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    3324                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3325                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3326                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3327                            .dwattr $C$DW$214, DW_AT_decl_line(0x27f)
    3328                            .dwattr $C$DW$214, DW_AT_decl_column(0x10)
    3329                    
    3330                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3331                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x26f)
    3332                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x0b)
    3333                            .dwendtag $C$DW$T$49
    3334                    
    3335                    
    3336                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3337                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x24)
    3338                    $C$DW$215       .dwtag  DW_TAG_member
    3339                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$38)
    3340                            .dwattr $C$DW$215, DW_AT_name("nInactivityTimeout")
    3341                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("nInactivityTimeout")
    3342                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3343                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3344                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3345                            .dwattr $C$DW$215, DW_AT_decl_line(0x515)
    3346                            .dwattr $C$DW$215, DW_AT_decl_column(0x1d)
    3347                    
    3348                    $C$DW$216       .dwtag  DW_TAG_member
    3349                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$51)
    3350                            .dwattr $C$DW$216, DW_AT_name("pRfMode")
    3351                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("pRfMode")
    3352                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3353                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3354                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   62

    3355                            .dwattr $C$DW$216, DW_AT_decl_line(0x516)
    3356                            .dwattr $C$DW$216, DW_AT_decl_column(0x1d)
    3357                    
    3358                    $C$DW$217       .dwtag  DW_TAG_member
    3359                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$53)
    3360                            .dwattr $C$DW$217, DW_AT_name("pRadioSetup")
    3361                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("pRadioSetup")
    3362                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3363                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3364                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3365                            .dwattr $C$DW$217, DW_AT_decl_line(0x517)
    3366                            .dwattr $C$DW$217, DW_AT_decl_column(0x1d)
    3367                    
    3368                    $C$DW$218       .dwtag  DW_TAG_member
    3369                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$38)
    3370                            .dwattr $C$DW$218, DW_AT_name("nPowerUpDuration")
    3371                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("nPowerUpDuration")
    3372                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3373                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3374                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3375                            .dwattr $C$DW$218, DW_AT_decl_line(0x518)
    3376                            .dwattr $C$DW$218, DW_AT_decl_column(0x1d)
    3377                    
    3378                    $C$DW$219       .dwtag  DW_TAG_member
    3379                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$54)
    3380                            .dwattr $C$DW$219, DW_AT_name("bMeasurePowerUpDuration")
    3381                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    3382                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3383                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3384                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3385                            .dwattr $C$DW$219, DW_AT_decl_line(0x519)
    3386                            .dwattr $C$DW$219, DW_AT_decl_column(0x1d)
    3387                    
    3388                    $C$DW$220       .dwtag  DW_TAG_member
    3389                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$54)
    3390                            .dwattr $C$DW$220, DW_AT_name("bUpdateSetup")
    3391                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("bUpdateSetup")
    3392                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3393                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3394                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3395                            .dwattr $C$DW$220, DW_AT_decl_line(0x51a)
    3396                            .dwattr $C$DW$220, DW_AT_decl_column(0x1d)
    3397                    
    3398                    $C$DW$221       .dwtag  DW_TAG_member
    3399                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$32)
    3400                            .dwattr $C$DW$221, DW_AT_name("nPowerUpDurationMargin")
    3401                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    3402                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3403                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3404                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3405                            .dwattr $C$DW$221, DW_AT_decl_line(0x51b)
    3406                            .dwattr $C$DW$221, DW_AT_decl_column(0x1d)
    3407                    
    3408                    $C$DW$222       .dwtag  DW_TAG_member
    3409                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   63

    3410                            .dwattr $C$DW$222, DW_AT_name("pPowerCb")
    3411                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pPowerCb")
    3412                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3413                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3414                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3415                            .dwattr $C$DW$222, DW_AT_decl_line(0x51c)
    3416                            .dwattr $C$DW$222, DW_AT_decl_column(0x1d)
    3417                    
    3418                    $C$DW$223       .dwtag  DW_TAG_member
    3419                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$3)
    3420                            .dwattr $C$DW$223, DW_AT_name("pErrCb")
    3421                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("pErrCb")
    3422                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3423                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3424                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3425                            .dwattr $C$DW$223, DW_AT_decl_line(0x51d)
    3426                            .dwattr $C$DW$223, DW_AT_decl_column(0x1d)
    3427                    
    3428                    $C$DW$224       .dwtag  DW_TAG_member
    3429                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$3)
    3430                            .dwattr $C$DW$224, DW_AT_name("pClientEventCb")
    3431                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("pClientEventCb")
    3432                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3433                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3434                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3435                            .dwattr $C$DW$224, DW_AT_decl_line(0x51e)
    3436                            .dwattr $C$DW$224, DW_AT_decl_column(0x1d)
    3437                    
    3438                    $C$DW$225       .dwtag  DW_TAG_member
    3439                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$55)
    3440                            .dwattr $C$DW$225, DW_AT_name("nClientEventMask")
    3441                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("nClientEventMask")
    3442                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3443                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3444                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3445                            .dwattr $C$DW$225, DW_AT_decl_line(0x51f)
    3446                            .dwattr $C$DW$225, DW_AT_decl_column(0x1d)
    3447                    
    3448                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3449                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x514)
    3450                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0c)
    3451                            .dwendtag $C$DW$T$56
    3452                    
    3453                    
    3454                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3455                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    3456                    $C$DW$226       .dwtag  DW_TAG_member
    3457                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$23)
    3458                            .dwattr $C$DW$226, DW_AT_name("triggerType")
    3459                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("triggerType")
    3460                            .dwattr $C$DW$226, DW_AT_bit_offset(0x04)
    3461                            .dwattr $C$DW$226, DW_AT_bit_size(0x04)
    3462                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3463                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3464                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v18.1.4 Wed Dec 12 16:09:00 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{5850645B-FFB3-4393-BD29-DE2E444B6A5A} PAGE   64

    3465                            .dwattr $C$DW$226, DW_AT_decl_line(0xee)
    3466                            .dwattr $C$DW$226, DW_AT_decl_column(0x0f)
    3467                    
    3468                    $C$DW$227       .dwtag  DW_TAG_member
    3469                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
    3470                            .dwattr $C$DW$227, DW_AT_name("bEnaCmd")
    3471                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("bEnaCmd")
    3472                            .dwattr $C$DW$227, DW_AT_bit_offset(0x03)
    3473                            .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    3474                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3475                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3476                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3477                            .dwattr $C$DW$227, DW_AT_decl_line(0xef)
    3478                            .dwattr $C$DW$227, DW_AT_decl_column(0x0f)
    3479                    
    3480                    $C$DW$228       .dwtag  DW_TAG_member
    3481                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    3482                            .dwattr $C$DW$228, DW_AT_name("triggerNo")
    3483                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("triggerNo")
    3484                            .dwattr $C$DW$228, DW_AT_bit_offset(0x01)
    3485                            .dwattr $C$DW$228, DW_AT_bit_size(0x02)
    3486                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3487                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3488                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3489                            .dwattr $C$DW$228, DW_AT_decl_line(0xf1)
    3490                            .dwattr $C$DW$228, DW_AT_decl_column(0x0f)
    3491                    
    3492                    $C$DW$229       .dwtag  DW_TAG_member
    3493                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$23)
    3494                            .dwattr $C$DW$229, DW_AT_name("pastTrig")
    3495                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pastTrig")
    3496                            .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    3497                            .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    3498                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3500                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3501                            .dwattr $C$DW$229, DW_AT_decl_line(0xf2)
    3502                            .dwattr $C$DW$229, DW_AT_decl_column(0x0f)
    3503                    
    3504                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3505                            .dwattr $C$DW$T$57, DW_AT_decl_line(0xed)
    3506                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x0b)
    3507                            .dwendtag $C$DW$T$57
    3508                    
    3509                    
    3510                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3511                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    3512                    $C$DW$230       .dwtag  DW_TAG_member
    3513                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$23)
    3514                            .dwattr $C$DW$230, DW_AT_name("rule")
    3515                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("rule")
