TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.4.LTS *
       3                    ;* Date/Time created: Wed Dec 12 18:32:41 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/sensor.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\DAMIAN\TIVA_CC1350\sensor_cc1350lp\sensor_cc1350lp"
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    7254                            .dwattr $C$DW$651, DW_AT_decl_column(0x04)
    7255                    
    7256                    $C$DW$652       .dwtag  DW_TAG_enumerator
    7257                            .dwattr $C$DW$652, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    7258                            .dwattr $C$DW$652, DW_AT_const_value(0xe5)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  135

    7259                            .dwattr $C$DW$652, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7260                            .dwattr $C$DW$652, DW_AT_decl_line(0x3e8)
    7261                            .dwattr $C$DW$652, DW_AT_decl_column(0x04)
    7262                    
    7263                            .dwattr $C$DW$T$585, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7264                            .dwattr $C$DW$T$585, DW_AT_decl_line(0x3dc)
    7265                            .dwattr $C$DW$T$585, DW_AT_decl_column(0x01)
    7266                            .dwendtag $C$DW$T$585
    7267                    
    7268                    $C$DW$T$586     .dwtag  DW_TAG_typedef
    7269                            .dwattr $C$DW$T$586, DW_AT_name("ICall_RemotiCmdEvent_t")
    7270                            .dwattr $C$DW$T$586, DW_AT_type(*$C$DW$T$585)
    7271                            .dwattr $C$DW$T$586, DW_AT_language(DW_LANG_C)
    7272                            .dwattr $C$DW$T$586, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7273                            .dwattr $C$DW$T$586, DW_AT_decl_line(0x3e9)
    7274                            .dwattr $C$DW$T$586, DW_AT_decl_column(0x02)
    7275                    
    7276                    
    7277                    $C$DW$T$587     .dwtag  DW_TAG_enumeration_type
    7278                            .dwattr $C$DW$T$587, DW_AT_byte_size(0x01)
    7279                    $C$DW$653       .dwtag  DW_TAG_enumerator
    7280                            .dwattr $C$DW$653, DW_AT_name("PIN_SUCCESS")
    7281                            .dwattr $C$DW$653, DW_AT_const_value(0x00)
    7282                            .dwattr $C$DW$653, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    7283                            .dwattr $C$DW$653, DW_AT_decl_line(0x2cd)
    7284                            .dwattr $C$DW$653, DW_AT_decl_column(0x05)
    7285                    
    7286                    $C$DW$654       .dwtag  DW_TAG_enumerator
    7287                            .dwattr $C$DW$654, DW_AT_name("PIN_ALREADY_ALLOCATED")
    7288                            .dwattr $C$DW$654, DW_AT_const_value(0x01)
    7289                            .dwattr $C$DW$654, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    7290                            .dwattr $C$DW$654, DW_AT_decl_line(0x2ce)
    7291                            .dwattr $C$DW$654, DW_AT_decl_column(0x05)
    7292                    
    7293                    $C$DW$655       .dwtag  DW_TAG_enumerator
    7294                            .dwattr $C$DW$655, DW_AT_name("PIN_NO_ACCESS")
    7295                            .dwattr $C$DW$655, DW_AT_const_value(0x02)
    7296                            .dwattr $C$DW$655, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    7297                            .dwattr $C$DW$655, DW_AT_decl_line(0x2cf)
    7298                            .dwattr $C$DW$655, DW_AT_decl_column(0x05)
    7299                    
    7300                    $C$DW$656       .dwtag  DW_TAG_enumerator
    7301                            .dwattr $C$DW$656, DW_AT_name("PIN_UNSUPPORTED")
    7302                            .dwattr $C$DW$656, DW_AT_const_value(0x03)
    7303                            .dwattr $C$DW$656, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    7304                            .dwattr $C$DW$656, DW_AT_decl_line(0x2d0)
    7305                            .dwattr $C$DW$656, DW_AT_decl_column(0x05)
    7306                    
    7307                            .dwattr $C$DW$T$587, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    7308                            .dwattr $C$DW$T$587, DW_AT_decl_line(0x2cc)
    7309                            .dwattr $C$DW$T$587, DW_AT_decl_column(0x0e)
    7310                            .dwendtag $C$DW$T$587
    7311                    
    7312                    $C$DW$T$588     .dwtag  DW_TAG_typedef
    7313                            .dwattr $C$DW$T$588, DW_AT_name("PIN_Status")
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  136

    7314                            .dwattr $C$DW$T$588, DW_AT_type(*$C$DW$T$587)
    7315                            .dwattr $C$DW$T$588, DW_AT_language(DW_LANG_C)
    7316                            .dwattr $C$DW$T$588, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    7317                            .dwattr $C$DW$T$588, DW_AT_decl_line(0x2d1)
    7318                            .dwattr $C$DW$T$588, DW_AT_decl_column(0x03)
    7319                    
    7320                    
    7321                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7322                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    7323                    $C$DW$657       .dwtag  DW_TAG_member
    7324                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$95)
    7325                            .dwattr $C$DW$657, DW_AT_name("addr")
    7326                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("addr")
    7327                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7328                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    7329                            .dwattr $C$DW$657, DW_AT_decl_file("..\Application\api_mac.h")
    7330                            .dwattr $C$DW$657, DW_AT_decl_line(0x4db)
    7331                            .dwattr $C$DW$657, DW_AT_decl_column(0x07)
    7332                    
    7333                    $C$DW$658       .dwtag  DW_TAG_member
    7334                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$22)
    7335                            .dwattr $C$DW$658, DW_AT_name("addrMode")
    7336                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("addrMode")
    7337                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7338                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    7339                            .dwattr $C$DW$658, DW_AT_decl_file("..\Application\api_mac.h")
    7340                            .dwattr $C$DW$658, DW_AT_decl_line(0x4de)
    7341                            .dwattr $C$DW$658, DW_AT_decl_column(0x17)
    7342                    
    7343                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\api_mac.h")
    7344                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d0)
    7345                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    7346                            .dwendtag $C$DW$T$23
    7347                    
    7348                    $C$DW$T$372     .dwtag  DW_TAG_typedef
    7349                            .dwattr $C$DW$T$372, DW_AT_name("ApiMac_sAddr_t")
    7350                            .dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$23)
    7351                            .dwattr $C$DW$T$372, DW_AT_language(DW_LANG_C)
    7352                            .dwattr $C$DW$T$372, DW_AT_decl_file("..\Application\api_mac.h")
    7353                            .dwattr $C$DW$T$372, DW_AT_decl_line(0x4df)
    7354                            .dwattr $C$DW$T$372, DW_AT_decl_column(0x03)
    7355                    
    7356                    $C$DW$T$589     .dwtag  DW_TAG_pointer_type
    7357                            .dwattr $C$DW$T$589, DW_AT_type(*$C$DW$T$372)
    7358                            .dwattr $C$DW$T$589, DW_AT_address_class(0x20)
    7359                    
    7360                    $C$DW$T$590     .dwtag  DW_TAG_const_type
    7361                            .dwattr $C$DW$T$590, DW_AT_type(*$C$DW$T$589)
    7362                    
    7363                    
    7364                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7365                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x40)
    7366                    $C$DW$659       .dwtag  DW_TAG_member
    7367                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$25)
    7368                            .dwattr $C$DW$659, DW_AT_name("beaconType")
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  137

    7369                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("beaconType")
    7370                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7371                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    7372                            .dwattr $C$DW$659, DW_AT_decl_file("..\Application\api_mac.h")
    7373                            .dwattr $C$DW$659, DW_AT_decl_line(0x886)
    7374                            .dwattr $C$DW$659, DW_AT_decl_column(0x19)
    7375                    
    7376                    $C$DW$660       .dwtag  DW_TAG_member
    7377                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$27)
    7378                            .dwattr $C$DW$660, DW_AT_name("bsn")
    7379                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("bsn")
    7380                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7381                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    7382                            .dwattr $C$DW$660, DW_AT_decl_file("..\Application\api_mac.h")
    7383                            .dwattr $C$DW$660, DW_AT_decl_line(0x888)
    7384                            .dwattr $C$DW$660, DW_AT_decl_column(0x0d)
    7385                    
    7386                    $C$DW$661       .dwtag  DW_TAG_member
    7387                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$28)
    7388                            .dwattr $C$DW$661, DW_AT_name("panDesc")
    7389                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("panDesc")
    7390                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7391                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    7392                            .dwattr $C$DW$661, DW_AT_decl_file("..\Application\api_mac.h")
    7393                            .dwattr $C$DW$661, DW_AT_decl_line(0x88a)
    7394                            .dwattr $C$DW$661, DW_AT_decl_column(0x16)
    7395                    
    7396                    $C$DW$662       .dwtag  DW_TAG_member
    7397                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$98)
    7398                            .dwattr $C$DW$662, DW_AT_name("beaconData")
    7399                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("beaconData")
    7400                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7401                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    7402                            .dwattr $C$DW$662, DW_AT_decl_file("..\Application\api_mac.h")
    7403                            .dwattr $C$DW$662, DW_AT_decl_line(0x895)
    7404                            .dwattr $C$DW$662, DW_AT_decl_column(0x07)
    7405                    
    7406                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\api_mac.h")
    7407                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x884)
    7408                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7409                            .dwendtag $C$DW$T$29
    7410                    
    7411                    $C$DW$T$285     .dwtag  DW_TAG_typedef
    7412                            .dwattr $C$DW$T$285, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    7413                            .dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$29)
    7414                            .dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
    7415                            .dwattr $C$DW$T$285, DW_AT_decl_file("..\Application\api_mac.h")
    7416                            .dwattr $C$DW$T$285, DW_AT_decl_line(0x896)
    7417                            .dwattr $C$DW$T$285, DW_AT_decl_column(0x03)
    7418                    
    7419                    $C$DW$T$286     .dwtag  DW_TAG_pointer_type
    7420                            .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$285)
    7421                            .dwattr $C$DW$T$286, DW_AT_address_class(0x20)
    7422                    
    7423                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  138

    7424                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7425                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    7426                    $C$DW$663       .dwtag  DW_TAG_member
    7427                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$30)
    7428                            .dwattr $C$DW$663, DW_AT_name("devInfo")
    7429                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("devInfo")
    7430                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7431                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    7432                            .dwattr $C$DW$663, DW_AT_decl_file("..\Application\llc.h")
    7433                            .dwattr $C$DW$663, DW_AT_decl_line(0x47)
    7434                            .dwattr $C$DW$663, DW_AT_decl_column(0x1f)
    7435                    
    7436                    $C$DW$664       .dwtag  DW_TAG_member
    7437                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$27)
    7438                            .dwattr $C$DW$664, DW_AT_name("channel")
    7439                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("channel")
    7440                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7441                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    7442                            .dwattr $C$DW$664, DW_AT_decl_file("..\Application\llc.h")
    7443                            .dwattr $C$DW$664, DW_AT_decl_line(0x49)
    7444                            .dwattr $C$DW$664, DW_AT_decl_column(0x0d)
    7445                    
    7446                    $C$DW$665       .dwtag  DW_TAG_member
    7447                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$31)
    7448                            .dwattr $C$DW$665, DW_AT_name("fh")
    7449                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("fh")
    7450                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7451                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    7452                            .dwattr $C$DW$665, DW_AT_decl_file("..\Application\llc.h")
    7453                            .dwattr $C$DW$665, DW_AT_decl_line(0x4b)
    7454                            .dwattr $C$DW$665, DW_AT_decl_column(0x0a)
    7455                    
    7456                            .dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\llc.h")
    7457                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x45)
    7458                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    7459                            .dwendtag $C$DW$T$32
    7460                    
    7461                    $C$DW$T$215     .dwtag  DW_TAG_typedef
    7462                            .dwattr $C$DW$T$215, DW_AT_name("Llc_netInfo_t")
    7463                            .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$32)
    7464                            .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    7465                            .dwattr $C$DW$T$215, DW_AT_decl_file("..\Application\llc.h")
    7466                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x4c)
    7467                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    7468                    
    7469                    $C$DW$T$216     .dwtag  DW_TAG_pointer_type
    7470                            .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    7471                            .dwattr $C$DW$T$216, DW_AT_address_class(0x20)
    7472                    
    7473                    $C$DW$T$593     .dwtag  DW_TAG_const_type
    7474                            .dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$216)
    7475                    
    7476                    
    7477                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7478                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  139

    7479                    $C$DW$666       .dwtag  DW_TAG_member
    7480                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$34)
    7481                            .dwattr $C$DW$666, DW_AT_name("frameControl")
    7482                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("frameControl")
    7483                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7484                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    7485                            .dwattr $C$DW$666, DW_AT_decl_file("..\Application\ssf.h")
    7486                            .dwattr $C$DW$666, DW_AT_decl_line(0x45)
    7487                            .dwattr $C$DW$666, DW_AT_decl_column(0x0e)
    7488                    
    7489                    $C$DW$667       .dwtag  DW_TAG_member
    7490                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$36)
    7491                            .dwattr $C$DW$667, DW_AT_name("reportingInterval")
    7492                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("reportingInterval")
    7493                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7494                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    7495                            .dwattr $C$DW$667, DW_AT_decl_file("..\Application\ssf.h")
    7496                            .dwattr $C$DW$667, DW_AT_decl_line(0x47)
    7497                            .dwattr $C$DW$667, DW_AT_decl_column(0x0e)
    7498                    
    7499                    $C$DW$668       .dwtag  DW_TAG_member
    7500                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$36)
    7501                            .dwattr $C$DW$668, DW_AT_name("pollingInterval")
    7502                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("pollingInterval")
    7503                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7504                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7505                            .dwattr $C$DW$668, DW_AT_decl_file("..\Application\ssf.h")
    7506                            .dwattr $C$DW$668, DW_AT_decl_line(0x49)
    7507                            .dwattr $C$DW$668, DW_AT_decl_column(0x0e)
    7508                    
    7509                            .dwattr $C$DW$T$37, DW_AT_decl_file("..\Application\ssf.h")
    7510                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x43)
    7511                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    7512                            .dwendtag $C$DW$T$37
    7513                    
    7514                    $C$DW$T$596     .dwtag  DW_TAG_typedef
    7515                            .dwattr $C$DW$T$596, DW_AT_name("Ssf_configSettings_t")
    7516                            .dwattr $C$DW$T$596, DW_AT_type(*$C$DW$T$37)
    7517                            .dwattr $C$DW$T$596, DW_AT_language(DW_LANG_C)
    7518                            .dwattr $C$DW$T$596, DW_AT_decl_file("..\Application\ssf.h")
    7519                            .dwattr $C$DW$T$596, DW_AT_decl_line(0x4a)
    7520                            .dwattr $C$DW$T$596, DW_AT_decl_column(0x03)
    7521                    
    7522                    $C$DW$T$597     .dwtag  DW_TAG_pointer_type
    7523                            .dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$596)
    7524                            .dwattr $C$DW$T$597, DW_AT_address_class(0x20)
    7525                    
    7526                    
    7527                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7528                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    7529                    $C$DW$669       .dwtag  DW_TAG_member
    7530                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$14)
    7531                            .dwattr $C$DW$669, DW_AT_name("__max_align1")
    7532                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("__max_align1")
    7533                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  140

    7534                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    7535                            .dwattr $C$DW$669, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7536                            .dwattr $C$DW$669, DW_AT_decl_line(0x70)
    7537                            .dwattr $C$DW$669, DW_AT_decl_column(0x0c)
    7538                    
    7539                    $C$DW$670       .dwtag  DW_TAG_member
    7540                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$18)
    7541                            .dwattr $C$DW$670, DW_AT_name("__max_align2")
    7542                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("__max_align2")
    7543                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7544                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7545                            .dwattr $C$DW$670, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7546                            .dwattr $C$DW$670, DW_AT_decl_line(0x71)
    7547                            .dwattr $C$DW$670, DW_AT_decl_column(0x0e)
    7548                    
    7549                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/
    7550                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x6f)
    7551                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    7552                            .dwendtag $C$DW$T$38
    7553                    
    7554                    $C$DW$T$599     .dwtag  DW_TAG_typedef
    7555                            .dwattr $C$DW$T$599, DW_AT_name("__max_align_t")
    7556                            .dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$38)
    7557                            .dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
    7558                            .dwattr $C$DW$T$599, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include
    7559                            .dwattr $C$DW$T$599, DW_AT_decl_line(0x72)
    7560                            .dwattr $C$DW$T$599, DW_AT_decl_column(0x03)
    7561                    
    7562                    
    7563                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7564                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    7565                    $C$DW$671       .dwtag  DW_TAG_member
    7566                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$36)
    7567                            .dwattr $C$DW$671, DW_AT_name("frameCounter")
    7568                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("frameCounter")
    7569                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7570                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7571                            .dwattr $C$DW$671, DW_AT_decl_file("..\Application\api_mac.h")
    7572                            .dwattr $C$DW$671, DW_AT_decl_line(0x575)
    7573                            .dwattr $C$DW$671, DW_AT_decl_column(0x1a)
    7574                    
    7575                    $C$DW$672       .dwtag  DW_TAG_member
    7576                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$34)
    7577                            .dwattr $C$DW$672, DW_AT_name("keyIdx")
    7578                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("keyIdx")
    7579                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7580                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7581                            .dwattr $C$DW$672, DW_AT_decl_file("..\Application\api_mac.h")
    7582                            .dwattr $C$DW$672, DW_AT_decl_line(0x576)
    7583                            .dwattr $C$DW$672, DW_AT_decl_column(0x1a)
    7584                    
    7585                            .dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\api_mac.h")
    7586                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x574)
    7587                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    7588                            .dwendtag $C$DW$T$39
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  141

    7589                    
    7590                    $C$DW$T$429     .dwtag  DW_TAG_typedef
    7591                            .dwattr $C$DW$T$429, DW_AT_name("ApiMac_frameCntr_t")
    7592                            .dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$39)
    7593                            .dwattr $C$DW$T$429, DW_AT_language(DW_LANG_C)
    7594                            .dwattr $C$DW$T$429, DW_AT_decl_file("..\Application\api_mac.h")
    7595                            .dwattr $C$DW$T$429, DW_AT_decl_line(0x577)
    7596                            .dwattr $C$DW$T$429, DW_AT_decl_column(0x03)
    7597                    
    7598                    $C$DW$T$430     .dwtag  DW_TAG_pointer_type
    7599                            .dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$429)
    7600                            .dwattr $C$DW$T$430, DW_AT_address_class(0x20)
    7601                    
    7602                    
    7603                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7604                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    7605                    $C$DW$673       .dwtag  DW_TAG_member
    7606                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$41)
    7607                            .dwattr $C$DW$673, DW_AT_name("fhNumPASolicitSent")
    7608                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("fhNumPASolicitSent")
    7609                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7610                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7611                            .dwattr $C$DW$673, DW_AT_decl_file("..\Application\jdllc.h")
    7612                            .dwattr $C$DW$673, DW_AT_decl_line(0x8b)
    7613                            .dwattr $C$DW$673, DW_AT_decl_column(0x0d)
    7614                    
    7615                    $C$DW$674       .dwtag  DW_TAG_member
    7616                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$41)
    7617                            .dwattr $C$DW$674, DW_AT_name("fhNumPAReceived")
    7618                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("fhNumPAReceived")
    7619                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7620                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7621                            .dwattr $C$DW$674, DW_AT_decl_file("..\Application\jdllc.h")
    7622                            .dwattr $C$DW$674, DW_AT_decl_line(0x8d)
    7623                            .dwattr $C$DW$674, DW_AT_decl_column(0x0d)
    7624                    
    7625                    $C$DW$675       .dwtag  DW_TAG_member
    7626                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$41)
    7627                            .dwattr $C$DW$675, DW_AT_name("fhNumPANConfigSolicitsSent")
    7628                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("fhNumPANConfigSolicitsSent")
    7629                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7630                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7631                            .dwattr $C$DW$675, DW_AT_decl_file("..\Application\jdllc.h")
    7632                            .dwattr $C$DW$675, DW_AT_decl_line(0x8f)
    7633                            .dwattr $C$DW$675, DW_AT_decl_column(0x0d)
    7634                    
    7635                    $C$DW$676       .dwtag  DW_TAG_member
    7636                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$41)
    7637                            .dwattr $C$DW$676, DW_AT_name("fhNumPANConfigReceived")
    7638                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("fhNumPANConfigReceived")
    7639                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7640                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7641                            .dwattr $C$DW$676, DW_AT_decl_file("..\Application\jdllc.h")
    7642                            .dwattr $C$DW$676, DW_AT_decl_line(0x91)
    7643                            .dwattr $C$DW$676, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  142

    7644                    
    7645                    $C$DW$677       .dwtag  DW_TAG_member
    7646                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$41)
    7647                            .dwattr $C$DW$677, DW_AT_name("otherStats")
    7648                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("otherStats")
    7649                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7650                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7651                            .dwattr $C$DW$677, DW_AT_decl_file("..\Application\jdllc.h")
    7652                            .dwattr $C$DW$677, DW_AT_decl_line(0x93)
    7653                            .dwattr $C$DW$677, DW_AT_decl_column(0x0d)
    7654                    
    7655                            .dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\jdllc.h")
    7656                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x89)
    7657                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    7658                            .dwendtag $C$DW$T$42
    7659                    
    7660                    $C$DW$T$600     .dwtag  DW_TAG_typedef
    7661                            .dwattr $C$DW$T$600, DW_AT_name("Jdllc_statistics_t")
    7662                            .dwattr $C$DW$T$600, DW_AT_type(*$C$DW$T$42)
    7663                            .dwattr $C$DW$T$600, DW_AT_language(DW_LANG_C)
    7664                            .dwattr $C$DW$T$600, DW_AT_decl_file("..\Application\jdllc.h")
    7665                            .dwattr $C$DW$T$600, DW_AT_decl_line(0x94)
    7666                            .dwattr $C$DW$T$600, DW_AT_decl_column(0x03)
    7667                    
    7668                    
    7669                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7670                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    7671                    $C$DW$678       .dwtag  DW_TAG_member
    7672                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$10)
    7673                            .dwattr $C$DW$678, DW_AT_name("quot")
    7674                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("quot")
    7675                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7676                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7677                            .dwattr $C$DW$678, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7678                            .dwattr $C$DW$678, DW_AT_decl_line(0x49)
    7679                            .dwattr $C$DW$678, DW_AT_decl_column(0x16)
    7680                    
    7681                    $C$DW$679       .dwtag  DW_TAG_member
    7682                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$10)
    7683                            .dwattr $C$DW$679, DW_AT_name("rem")
    7684                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("rem")
    7685                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7686                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7687                            .dwattr $C$DW$679, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7688                            .dwattr $C$DW$679, DW_AT_decl_line(0x49)
    7689                            .dwattr $C$DW$679, DW_AT_decl_column(0x1c)
    7690                    
    7691                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/
    7692                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x49)
    7693                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    7694                            .dwendtag $C$DW$T$43
    7695                    
    7696                    $C$DW$T$601     .dwtag  DW_TAG_typedef
    7697                            .dwattr $C$DW$T$601, DW_AT_name("div_t")
    7698                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  143

    7699                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    7700                            .dwattr $C$DW$T$601, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include
    7701                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x49)
    7702                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x23)
    7703                    
    7704                    
    7705                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7706                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    7707                    $C$DW$680       .dwtag  DW_TAG_member
    7708                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$10)
    7709                            .dwattr $C$DW$680, DW_AT_name("quot")
    7710                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("quot")
    7711                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7712                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7713                            .dwattr $C$DW$680, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7714                            .dwattr $C$DW$680, DW_AT_decl_line(0x4e)
    7715                            .dwattr $C$DW$680, DW_AT_decl_column(0x16)
    7716                    
    7717                    $C$DW$681       .dwtag  DW_TAG_member
    7718                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$10)
    7719                            .dwattr $C$DW$681, DW_AT_name("rem")
    7720                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("rem")
    7721                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7722                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7723                            .dwattr $C$DW$681, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7724                            .dwattr $C$DW$681, DW_AT_decl_line(0x4e)
    7725                            .dwattr $C$DW$681, DW_AT_decl_column(0x1c)
    7726                    
    7727                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/
    7728                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4e)
    7729                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    7730                            .dwendtag $C$DW$T$44
    7731                    
    7732                    $C$DW$T$602     .dwtag  DW_TAG_typedef
    7733                            .dwattr $C$DW$T$602, DW_AT_name("ldiv_t")
    7734                            .dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$44)
    7735                            .dwattr $C$DW$T$602, DW_AT_language(DW_LANG_C)
    7736                            .dwattr $C$DW$T$602, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include
    7737                            .dwattr $C$DW$T$602, DW_AT_decl_line(0x4e)
    7738                            .dwattr $C$DW$T$602, DW_AT_decl_column(0x23)
    7739                    
    7740                    
    7741                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7742                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x10)
    7743                    $C$DW$682       .dwtag  DW_TAG_member
    7744                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$14)
    7745                            .dwattr $C$DW$682, DW_AT_name("quot")
    7746                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("quot")
    7747                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7748                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7749                            .dwattr $C$DW$682, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7750                            .dwattr $C$DW$682, DW_AT_decl_line(0x56)
    7751                            .dwattr $C$DW$682, DW_AT_decl_column(0x1c)
    7752                    
    7753                    $C$DW$683       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  144

    7754                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$14)
    7755                            .dwattr $C$DW$683, DW_AT_name("rem")
    7756                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("rem")
    7757                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7758                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7759                            .dwattr $C$DW$683, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/s
    7760                            .dwattr $C$DW$683, DW_AT_decl_line(0x56)
    7761                            .dwattr $C$DW$683, DW_AT_decl_column(0x22)
    7762                    
    7763                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include/
    7764                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x56)
    7765                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    7766                            .dwendtag $C$DW$T$45
    7767                    
    7768                    $C$DW$T$603     .dwtag  DW_TAG_typedef
    7769                            .dwattr $C$DW$T$603, DW_AT_name("lldiv_t")
    7770                            .dwattr $C$DW$T$603, DW_AT_type(*$C$DW$T$45)
    7771                            .dwattr $C$DW$T$603, DW_AT_language(DW_LANG_C)
    7772                            .dwattr $C$DW$T$603, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.4.LTS/include
    7773                            .dwattr $C$DW$T$603, DW_AT_decl_line(0x56)
    7774                            .dwattr $C$DW$T$603, DW_AT_decl_column(0x29)
    7775                    
    7776                    
    7777                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7778                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    7779                    $C$DW$684       .dwtag  DW_TAG_member
    7780                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$48)
    7781                            .dwattr $C$DW$684, DW_AT_name("pointerStack")
    7782                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("pointerStack")
    7783                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7784                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7785                            .dwattr $C$DW$684, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7786                            .dwattr $C$DW$684, DW_AT_decl_line(0x3f5)
    7787                            .dwattr $C$DW$684, DW_AT_decl_column(0x16)
    7788                    
    7789                    $C$DW$685       .dwtag  DW_TAG_member
    7790                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$49)
    7791                            .dwattr $C$DW$685, DW_AT_name("directAPI")
    7792                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("directAPI")
    7793                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7794                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7795                            .dwattr $C$DW$685, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7796                            .dwattr $C$DW$685, DW_AT_decl_line(0x3f6)
    7797                            .dwattr $C$DW$685, DW_AT_decl_column(0x15)
    7798                    
    7799                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7800                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x3f4)
    7801                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    7802                            .dwendtag $C$DW$T$50
    7803                    
    7804                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    7805                            .dwattr $C$DW$T$52, DW_AT_name("icall_directAPIMsg_t")
    7806                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
    7807                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7808                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  145

    7809                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x3f7)
    7810                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    7811                    
    7812                    
    7813                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7814                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    7815                    $C$DW$686       .dwtag  DW_TAG_member
    7816                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$51)
    7817                            .dwattr $C$DW$686, DW_AT_name("hdr")
    7818                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("hdr")
    7819                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7820                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7821                            .dwattr $C$DW$686, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7822                            .dwattr $C$DW$686, DW_AT_decl_line(0x3fb)
    7823                            .dwattr $C$DW$686, DW_AT_decl_column(0x10)
    7824                    
    7825                    $C$DW$687       .dwtag  DW_TAG_member
    7826                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$52)
    7827                            .dwattr $C$DW$687, DW_AT_name("msg")
    7828                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("msg")
    7829                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7830                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7831                            .dwattr $C$DW$687, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7832                            .dwattr $C$DW$687, DW_AT_decl_line(0x3fc)
    7833                            .dwattr $C$DW$687, DW_AT_decl_column(0x1a)
    7834                    
    7835                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7836                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3fa)
    7837                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    7838                            .dwendtag $C$DW$T$53
    7839                    
    7840                    $C$DW$T$604     .dwtag  DW_TAG_typedef
    7841                            .dwattr $C$DW$T$604, DW_AT_name("icallLiteMsg_t")
    7842                            .dwattr $C$DW$T$604, DW_AT_type(*$C$DW$T$53)
    7843                            .dwattr $C$DW$T$604, DW_AT_language(DW_LANG_C)
    7844                            .dwattr $C$DW$T$604, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7845                            .dwattr $C$DW$T$604, DW_AT_decl_line(0x3fd)
    7846                            .dwattr $C$DW$T$604, DW_AT_decl_column(0x03)
    7847                    
    7848                    
    7849                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    7850                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x4c)
    7851                    $C$DW$688       .dwtag  DW_TAG_member
    7852                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$57)
    7853                            .dwattr $C$DW$688, DW_AT_name("Crc32")
    7854                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("Crc32")
    7855                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7856                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7857                            .dwattr $C$DW$688, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7858                            .dwattr $C$DW$688, DW_AT_decl_line(0x76)
    7859                            .dwattr $C$DW$688, DW_AT_decl_column(0x25)
    7860                    
    7861                    $C$DW$689       .dwtag  DW_TAG_member
    7862                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$60)
    7863                            .dwattr $C$DW$689, DW_AT_name("FlashGetSize")
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  146

    7864                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("FlashGetSize")
    7865                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7866                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7867                            .dwattr $C$DW$689, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7868                            .dwattr $C$DW$689, DW_AT_decl_line(0x77)
    7869                            .dwattr $C$DW$689, DW_AT_decl_column(0x25)
    7870                    
    7871                    $C$DW$690       .dwtag  DW_TAG_member
    7872                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$61)
    7873                            .dwattr $C$DW$690, DW_AT_name("GetChipId")
    7874                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("GetChipId")
    7875                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7876                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7877                            .dwattr $C$DW$690, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7878                            .dwattr $C$DW$690, DW_AT_decl_line(0x78)
    7879                            .dwattr $C$DW$690, DW_AT_decl_column(0x25)
    7880                    
    7881                    $C$DW$691       .dwtag  DW_TAG_member
    7882                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$64)
    7883                            .dwattr $C$DW$691, DW_AT_name("ReservedLocation1")
    7884                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("ReservedLocation1")
    7885                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7886                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7887                            .dwattr $C$DW$691, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7888                            .dwattr $C$DW$691, DW_AT_decl_line(0x79)
    7889                            .dwattr $C$DW$691, DW_AT_decl_column(0x25)
    7890                    
    7891                    $C$DW$692       .dwtag  DW_TAG_member
    7892                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$65)
    7893                            .dwattr $C$DW$692, DW_AT_name("ReservedLocation2")
    7894                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("ReservedLocation2")
    7895                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7896                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7897                            .dwattr $C$DW$692, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7898                            .dwattr $C$DW$692, DW_AT_decl_line(0x7a)
    7899                            .dwattr $C$DW$692, DW_AT_decl_column(0x25)
    7900                    
    7901                    $C$DW$693       .dwtag  DW_TAG_member
    7902                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$66)
    7903                            .dwattr $C$DW$693, DW_AT_name("ReservedLocation3")
    7904                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("ReservedLocation3")
    7905                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7906                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7907                            .dwattr $C$DW$693, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7908                            .dwattr $C$DW$693, DW_AT_decl_line(0x7b)
    7909                            .dwattr $C$DW$693, DW_AT_decl_column(0x25)
    7910                    
    7911                    $C$DW$694       .dwtag  DW_TAG_member
    7912                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$69)
    7913                            .dwattr $C$DW$694, DW_AT_name("ResetDevice")
    7914                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("ResetDevice")
    7915                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7916                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7917                            .dwattr $C$DW$694, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7918                            .dwattr $C$DW$694, DW_AT_decl_line(0x7c)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  147

    7919                            .dwattr $C$DW$694, DW_AT_decl_column(0x25)
    7920                    
    7921                    $C$DW$695       .dwtag  DW_TAG_member
    7922                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$73)
    7923                            .dwattr $C$DW$695, DW_AT_name("Fletcher32")
    7924                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("Fletcher32")
    7925                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7926                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7927                            .dwattr $C$DW$695, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7928                            .dwattr $C$DW$695, DW_AT_decl_line(0x7d)
    7929                            .dwattr $C$DW$695, DW_AT_decl_column(0x25)
    7930                    
    7931                    $C$DW$696       .dwtag  DW_TAG_member
    7932                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$77)
    7933                            .dwattr $C$DW$696, DW_AT_name("MinValue")
    7934                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("MinValue")
    7935                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7936                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7937                            .dwattr $C$DW$696, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7938                            .dwattr $C$DW$696, DW_AT_decl_line(0x7e)
    7939                            .dwattr $C$DW$696, DW_AT_decl_column(0x25)
    7940                    
    7941                    $C$DW$697       .dwtag  DW_TAG_member
    7942                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$78)
    7943                            .dwattr $C$DW$697, DW_AT_name("MaxValue")
    7944                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("MaxValue")
    7945                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7946                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7947                            .dwattr $C$DW$697, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7948                            .dwattr $C$DW$697, DW_AT_decl_line(0x7f)
    7949                            .dwattr $C$DW$697, DW_AT_decl_column(0x25)
    7950                    
    7951                    $C$DW$698       .dwtag  DW_TAG_member
    7952                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$79)
    7953                            .dwattr $C$DW$698, DW_AT_name("MeanValue")
    7954                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("MeanValue")
    7955                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7956                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7957                            .dwattr $C$DW$698, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7958                            .dwattr $C$DW$698, DW_AT_decl_line(0x80)
    7959                            .dwattr $C$DW$698, DW_AT_decl_column(0x25)
    7960                    
    7961                    $C$DW$699       .dwtag  DW_TAG_member
    7962                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$80)
    7963                            .dwattr $C$DW$699, DW_AT_name("StandDeviationValue")
    7964                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("StandDeviationValue")
    7965                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7966                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7967                            .dwattr $C$DW$699, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7968                            .dwattr $C$DW$699, DW_AT_decl_line(0x81)
    7969                            .dwattr $C$DW$699, DW_AT_decl_column(0x25)
    7970                    
    7971                    $C$DW$700       .dwtag  DW_TAG_member
    7972                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$83)
    7973                            .dwattr $C$DW$700, DW_AT_name("ReservedLocation4")
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  148

    7974                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("ReservedLocation4")
    7975                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7976                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7977                            .dwattr $C$DW$700, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7978                            .dwattr $C$DW$700, DW_AT_decl_line(0x82)
    7979                            .dwattr $C$DW$700, DW_AT_decl_column(0x25)
    7980                    
    7981                    $C$DW$701       .dwtag  DW_TAG_member
    7982                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$84)
    7983                            .dwattr $C$DW$701, DW_AT_name("ReservedLocation5")
    7984                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("ReservedLocation5")
    7985                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7986                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7987                            .dwattr $C$DW$701, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7988                            .dwattr $C$DW$701, DW_AT_decl_line(0x83)
    7989                            .dwattr $C$DW$701, DW_AT_decl_column(0x25)
    7990                    
    7991                    $C$DW$702       .dwtag  DW_TAG_member
    7992                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$85)
    7993                            .dwattr $C$DW$702, DW_AT_name("HFSourceSafeSwitch")
    7994                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7995                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7996                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7997                            .dwattr $C$DW$702, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7998                            .dwattr $C$DW$702, DW_AT_decl_line(0x84)
    7999                            .dwattr $C$DW$702, DW_AT_decl_column(0x25)
    8000                    
    8001                    $C$DW$703       .dwtag  DW_TAG_member
    8002                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$88)
    8003                            .dwattr $C$DW$703, DW_AT_name("SelectCompAInput")
    8004                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("SelectCompAInput")
    8005                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8006                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8007                            .dwattr $C$DW$703, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8008                            .dwattr $C$DW$703, DW_AT_decl_line(0x85)
    8009                            .dwattr $C$DW$703, DW_AT_decl_column(0x25)
    8010                    
    8011                    $C$DW$704       .dwtag  DW_TAG_member
    8012                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$89)
    8013                            .dwattr $C$DW$704, DW_AT_name("SelectCompARef")
    8014                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("SelectCompARef")
    8015                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8016                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8017                            .dwattr $C$DW$704, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8018                            .dwattr $C$DW$704, DW_AT_decl_line(0x86)
    8019                            .dwattr $C$DW$704, DW_AT_decl_column(0x25)
    8020                    
    8021                    $C$DW$705       .dwtag  DW_TAG_member
    8022                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$90)
    8023                            .dwattr $C$DW$705, DW_AT_name("SelectADCCompBInput")
    8024                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("SelectADCCompBInput")
    8025                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8026                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8027                            .dwattr $C$DW$705, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8028                            .dwattr $C$DW$705, DW_AT_decl_line(0x87)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  149

    8029                            .dwattr $C$DW$705, DW_AT_decl_column(0x25)
    8030                    
    8031                    $C$DW$706       .dwtag  DW_TAG_member
    8032                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$91)
    8033                            .dwattr $C$DW$706, DW_AT_name("SelectCompBRef")
    8034                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("SelectCompBRef")
    8035                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8036                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8037                            .dwattr $C$DW$706, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8038                            .dwattr $C$DW$706, DW_AT_decl_line(0x88)
    8039                            .dwattr $C$DW$706, DW_AT_decl_column(0x25)
    8040                    
    8041                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    8042                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x75)
    8043                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    8044                            .dwendtag $C$DW$T$92
    8045                    
    8046                    $C$DW$T$605     .dwtag  DW_TAG_typedef
    8047                            .dwattr $C$DW$T$605, DW_AT_name("HARD_API_T")
    8048                            .dwattr $C$DW$T$605, DW_AT_type(*$C$DW$T$92)
    8049                            .dwattr $C$DW$T$605, DW_AT_language(DW_LANG_C)
    8050                            .dwattr $C$DW$T$605, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    8051                            .dwattr $C$DW$T$605, DW_AT_decl_line(0x89)
    8052                            .dwattr $C$DW$T$605, DW_AT_decl_column(0x03)
    8053                    
    8054                    
    8055                    $C$DW$T$95      .dwtag  DW_TAG_union_type
    8056                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x08)
    8057                    $C$DW$707       .dwtag  DW_TAG_member
    8058                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$34)
    8059                            .dwattr $C$DW$707, DW_AT_name("shortAddr")
    8060                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("shortAddr")
    8061                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8062                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8063                            .dwattr $C$DW$707, DW_AT_decl_file("..\Application\api_mac.h")
    8064                            .dwattr $C$DW$707, DW_AT_decl_line(0x4d8)
    8065                            .dwattr $C$DW$707, DW_AT_decl_column(0x12)
    8066                    
    8067                    $C$DW$708       .dwtag  DW_TAG_member
    8068                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$94)
    8069                            .dwattr $C$DW$708, DW_AT_name("extAddr")
    8070                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("extAddr")
    8071                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8072                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8073                            .dwattr $C$DW$708, DW_AT_decl_file("..\Application\api_mac.h")
    8074                            .dwattr $C$DW$708, DW_AT_decl_line(0x4da)
    8075                            .dwattr $C$DW$708, DW_AT_decl_column(0x1b)
    8076                    
    8077                            .dwattr $C$DW$T$95, DW_AT_decl_file("..\Application\api_mac.h")
    8078                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x4d6)
    8079                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x05)
    8080                            .dwendtag $C$DW$T$95
    8081                    
    8082                    
    8083                    $C$DW$T$98      .dwtag  DW_TAG_union_type
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  150

    8084                            .dwattr $C$DW$T$98, DW_AT_byte_size(0x18)
    8085                    $C$DW$709       .dwtag  DW_TAG_member
    8086                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$96)
    8087                            .dwattr $C$DW$709, DW_AT_name("beacon")
    8088                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("beacon")
    8089                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8090                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8091                            .dwattr $C$DW$709, DW_AT_decl_file("..\Application\api_mac.h")
    8092                            .dwattr $C$DW$709, DW_AT_decl_line(0x892)
    8093                            .dwattr $C$DW$709, DW_AT_decl_column(0x1d)
    8094                    
    8095                    $C$DW$710       .dwtag  DW_TAG_member
    8096                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$97)
    8097                            .dwattr $C$DW$710, DW_AT_name("eBeacon")
    8098                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("eBeacon")
    8099                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8100                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8101                            .dwattr $C$DW$710, DW_AT_decl_file("..\Application\api_mac.h")
    8102                            .dwattr $C$DW$710, DW_AT_decl_line(0x894)
    8103                            .dwattr $C$DW$710, DW_AT_decl_column(0x1e)
    8104                    
    8105                            .dwattr $C$DW$T$98, DW_AT_decl_file("..\Application\api_mac.h")
    8106                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x890)
    8107                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x05)
    8108                            .dwendtag $C$DW$T$98
    8109                    
    8110                    
    8111                    $C$DW$T$100     .dwtag  DW_TAG_union_type
    8112                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    8113                    $C$DW$711       .dwtag  DW_TAG_member
    8114                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$54)
    8115                            .dwattr $C$DW$711, DW_AT_name("pEnergyDetect")
    8116                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("pEnergyDetect")
    8117                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8118                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8119                            .dwattr $C$DW$711, DW_AT_decl_file("..\Application\api_mac.h")
    8120                            .dwattr $C$DW$711, DW_AT_decl_line(0x8b4)
    8121                            .dwattr $C$DW$711, DW_AT_decl_column(0x12)
    8122                    
    8123                    $C$DW$712       .dwtag  DW_TAG_member
    8124                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$99)
    8125                            .dwattr $C$DW$712, DW_AT_name("pPanDescriptor")
    8126                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("pPanDescriptor")
    8127                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8128                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8129                            .dwattr $C$DW$712, DW_AT_decl_file("..\Application\api_mac.h")
    8130                            .dwattr $C$DW$712, DW_AT_decl_line(0x8b6)
    8131                            .dwattr $C$DW$712, DW_AT_decl_column(0x1b)
    8132                    
    8133                            .dwattr $C$DW$T$100, DW_AT_decl_file("..\Application\api_mac.h")
    8134                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x8b2)
    8135                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x05)
    8136                            .dwendtag $C$DW$T$100
    8137                    
    8138                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  151

    8139                    $C$DW$T$107     .dwtag  DW_TAG_union_type
    8140                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x02)
    8141                    $C$DW$713       .dwtag  DW_TAG_member
    8142                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$103)
    8143                            .dwattr $C$DW$713, DW_AT_name("entityId")
    8144                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("entityId")
    8145                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8146                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8147                            .dwattr $C$DW$713, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8148                            .dwattr $C$DW$713, DW_AT_decl_line(0x1fe)
    8149                            .dwattr $C$DW$713, DW_AT_decl_column(0x14)
    8150                    
    8151                    $C$DW$714       .dwtag  DW_TAG_member
    8152                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$106)
    8153                            .dwattr $C$DW$714, DW_AT_name("servId")
    8154                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("servId")
    8155                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8156                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8157                            .dwattr $C$DW$714, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8158                            .dwattr $C$DW$714, DW_AT_decl_line(0x200)
    8159                            .dwattr $C$DW$714, DW_AT_decl_column(0x17)
    8160                    
    8161                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8162                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x1fc)
    8163                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x03)
    8164                            .dwendtag $C$DW$T$107
    8165                    
    8166                    
    8167                    $C$DW$T$108     .dwtag  DW_TAG_union_type
    8168                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x02)
    8169                    $C$DW$715       .dwtag  DW_TAG_member
    8170                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$106)
    8171                            .dwattr $C$DW$715, DW_AT_name("servId")
    8172                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("servId")
    8173                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8174                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8175                            .dwattr $C$DW$715, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8176                            .dwattr $C$DW$715, DW_AT_decl_line(0x211)
    8177                            .dwattr $C$DW$715, DW_AT_decl_column(0x17)
    8178                    
    8179                    $C$DW$716       .dwtag  DW_TAG_member
    8180                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$103)
    8181                            .dwattr $C$DW$716, DW_AT_name("entityId")
    8182                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("entityId")
    8183                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8184                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8185                            .dwattr $C$DW$716, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8186                            .dwattr $C$DW$716, DW_AT_decl_line(0x213)
    8187                            .dwattr $C$DW$716, DW_AT_decl_column(0x14)
    8188                    
    8189                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8190                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20f)
    8191                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x03)
    8192                            .dwendtag $C$DW$T$108
    8193                    
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  152

    8194                    
    8195                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    8196                            .dwattr $C$DW$T$110, DW_AT_name(".ggroup1")
    8197                            .dwattr $C$DW$T$110, DW_AT_byte_size(0xd0)
    8198                    $C$DW$717       .dwtag  DW_TAG_member
    8199                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$6)
    8200                            .dwattr $C$DW$717, DW_AT_name("rejoining")
    8201                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("rejoining")
    8202                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8203                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8204                    
    8205                    $C$DW$718       .dwtag  DW_TAG_member
    8206                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$6)
    8207                            .dwattr $C$DW$718, DW_AT_name("deviceTxMsduHandle")
    8208                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("deviceTxMsduHandle")
    8209                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8210                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8211                    
    8212                    $C$DW$719       .dwtag  DW_TAG_member
    8213                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$9)
    8214                            .dwattr $C$DW$719, DW_AT_name("Sensor_events")
    8215                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("Sensor_events")
    8216                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8217                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8218                    
    8219                    $C$DW$720       .dwtag  DW_TAG_member
    8220                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$248)
    8221                            .dwattr $C$DW$720, DW_AT_name("lightSensor")
    8222                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("lightSensor")
    8223                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8224                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8225                    
    8226                    $C$DW$721       .dwtag  DW_TAG_member
    8227                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$9)
    8228                            .dwattr $C$DW$721, DW_AT_name("lastRcvdBroadcastMsgId")
    8229                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("lastRcvdBroadcastMsgId")
    8230                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8231                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8232                    
    8233                    $C$DW$722       .dwtag  DW_TAG_member
    8234                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$109)
    8235                            .dwattr $C$DW$722, DW_AT_name("display")
    8236                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("display")
    8237                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8238                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8239                    
    8240                    $C$DW$723       .dwtag  DW_TAG_member
    8241                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$3)
    8242                            .dwattr $C$DW$723, DW_AT_name("sem")
    8243                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("sem")
    8244                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8245                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8246                    
    8247                    $C$DW$724       .dwtag  DW_TAG_member
    8248                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$11)
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  153

    8249                            .dwattr $C$DW$724, DW_AT_name("joinTimeTicks")
    8250                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("joinTimeTicks")
    8251                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8252                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8253                    
    8254                    $C$DW$725       .dwtag  DW_TAG_member
    8255                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$11)
    8256                            .dwattr $C$DW$725, DW_AT_name("startSensorMsgTimeStamp")
    8257                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("startSensorMsgTimeStamp")
    8258                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8259                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8260                    
    8261                    $C$DW$726       .dwtag  DW_TAG_member
    8262                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$258)
    8263                            .dwattr $C$DW$726, DW_AT_name("tempSensor")
    8264                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("tempSensor")
    8265                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8266                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8267                    
    8268                    $C$DW$727       .dwtag  DW_TAG_member
    8269                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$245)
    8270                            .dwattr $C$DW$727, DW_AT_name("humiditySensor")
    8271                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("humiditySensor")
    8272                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8273                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8274                    
    8275                    $C$DW$728       .dwtag  DW_TAG_member
    8276                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$23)
    8277                            .dwattr $C$DW$728, DW_AT_name("collectorAddr")
    8278                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("collectorAddr")
    8279                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8280                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8281                    
    8282                    $C$DW$729       .dwtag  DW_TAG_member
    8283                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$240)
    8284                            .dwattr $C$DW$729, DW_AT_name("configSettings")
    8285                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("configSettings")
    8286                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8287                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8288                    
    8289                    $C$DW$730       .dwtag  DW_TAG_member
    8290                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    8291                            .dwattr $C$DW$730, DW_AT_name("parentInfo")
    8292                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("parentInfo")
    8293                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8294                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8295                    
    8296                    $C$DW$731       .dwtag  DW_TAG_member
    8297                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$236)
    8298                            .dwattr $C$DW$731, DW_AT_name("jdllcCallbacks")
    8299                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("jdllcCallbacks")
    8300                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8301                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8302                    
    8303                    $C$DW$732       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  154

    8304                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$249)
    8305                            .dwattr $C$DW$732, DW_AT_name("Sensor_msgStats")
    8306                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("Sensor_msgStats")
    8307                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8308                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8309                    
    8310                    $C$DW$733       .dwtag  DW_TAG_member
    8311                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$353)
    8312                            .dwattr $C$DW$733, DW_AT_name("Sensor_macCallbacks")
    8313                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("Sensor_macCallbacks")
    8314                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    8315                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8316                    
    8317                            .dwendtag $C$DW$T$110
    8318                    
    8319                    
    8320                    $C$DW$T$608     .dwtag  DW_TAG_enumeration_type
    8321                            .dwattr $C$DW$T$608, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    8322                            .dwattr $C$DW$T$608, DW_AT_byte_size(0x01)
    8323                    $C$DW$734       .dwtag  DW_TAG_enumerator
    8324                            .dwattr $C$DW$734, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL0")
    8325                            .dwattr $C$DW$734, DW_AT_const_value(0x00)
    8326                            .dwattr $C$DW$734, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8327                            .dwattr $C$DW$734, DW_AT_decl_line(0xae)
    8328                            .dwattr $C$DW$734, DW_AT_decl_column(0x05)
    8329                    
    8330                    $C$DW$735       .dwtag  DW_TAG_enumerator
    8331                            .dwattr $C$DW$735, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL1")
    8332                            .dwattr $C$DW$735, DW_AT_const_value(0x01)
    8333                            .dwattr $C$DW$735, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8334                            .dwattr $C$DW$735, DW_AT_decl_line(0xaf)
    8335                            .dwattr $C$DW$735, DW_AT_decl_column(0x05)
    8336                    
    8337                    $C$DW$736       .dwtag  DW_TAG_enumerator
    8338                            .dwattr $C$DW$736, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL2")
    8339                            .dwattr $C$DW$736, DW_AT_const_value(0x02)
    8340                            .dwattr $C$DW$736, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8341                            .dwattr $C$DW$736, DW_AT_decl_line(0xb0)
    8342                            .dwattr $C$DW$736, DW_AT_decl_column(0x05)
    8343                    
    8344                    $C$DW$737       .dwtag  DW_TAG_enumerator
    8345                            .dwattr $C$DW$737, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL3")
    8346                            .dwattr $C$DW$737, DW_AT_const_value(0x03)
    8347                            .dwattr $C$DW$737, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8348                            .dwattr $C$DW$737, DW_AT_decl_line(0xb1)
    8349                            .dwattr $C$DW$737, DW_AT_decl_column(0x05)
    8350                    
    8351                    $C$DW$738       .dwtag  DW_TAG_enumerator
    8352                            .dwattr $C$DW$738, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL4")
    8353                            .dwattr $C$DW$738, DW_AT_const_value(0x04)
    8354                            .dwattr $C$DW$738, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8355                            .dwattr $C$DW$738, DW_AT_decl_line(0xb2)
    8356                            .dwattr $C$DW$738, DW_AT_decl_column(0x05)
    8357                    
    8358                    $C$DW$739       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  155

    8359                            .dwattr $C$DW$739, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL5")
    8360                            .dwattr $C$DW$739, DW_AT_const_value(0x05)
    8361                            .dwattr $C$DW$739, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8362                            .dwattr $C$DW$739, DW_AT_decl_line(0xb3)
    8363                            .dwattr $C$DW$739, DW_AT_decl_column(0x05)
    8364                    
    8365                    $C$DW$740       .dwtag  DW_TAG_enumerator
    8366                            .dwattr $C$DW$740, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL6")
    8367                            .dwattr $C$DW$740, DW_AT_const_value(0x06)
    8368                            .dwattr $C$DW$740, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8369                            .dwattr $C$DW$740, DW_AT_decl_line(0xb4)
    8370                            .dwattr $C$DW$740, DW_AT_decl_column(0x05)
    8371                    
    8372                    $C$DW$741       .dwtag  DW_TAG_enumerator
    8373                            .dwattr $C$DW$741, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL7")
    8374                            .dwattr $C$DW$741, DW_AT_const_value(0x07)
    8375                            .dwattr $C$DW$741, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8376                            .dwattr $C$DW$741, DW_AT_decl_line(0xb5)
    8377                            .dwattr $C$DW$741, DW_AT_decl_column(0x05)
    8378                    
    8379                    $C$DW$742       .dwtag  DW_TAG_enumerator
    8380                            .dwattr $C$DW$742, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVDDS")
    8381                            .dwattr $C$DW$742, DW_AT_const_value(0x08)
    8382                            .dwattr $C$DW$742, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8383                            .dwattr $C$DW$742, DW_AT_decl_line(0xb6)
    8384                            .dwattr $C$DW$742, DW_AT_decl_column(0x05)
    8385                    
    8386                    $C$DW$743       .dwtag  DW_TAG_enumerator
    8387                            .dwattr $C$DW$743, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
    8388                            .dwattr $C$DW$743, DW_AT_const_value(0x09)
    8389                            .dwattr $C$DW$743, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8390                            .dwattr $C$DW$743, DW_AT_decl_line(0xb7)
    8391                            .dwattr $C$DW$743, DW_AT_decl_column(0x05)
    8392                    
    8393                    $C$DW$744       .dwtag  DW_TAG_enumerator
    8394                            .dwattr $C$DW$744, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVSS")
    8395                            .dwattr $C$DW$744, DW_AT_const_value(0x0a)
    8396                            .dwattr $C$DW$744, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8397                            .dwattr $C$DW$744, DW_AT_decl_line(0xb8)
    8398                            .dwattr $C$DW$744, DW_AT_decl_column(0x05)
    8399                    
    8400                    $C$DW$745       .dwtag  DW_TAG_enumerator
    8401                            .dwattr $C$DW$745, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELCOUNT")
    8402                            .dwattr $C$DW$745, DW_AT_const_value(0x0b)
    8403                            .dwattr $C$DW$745, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8404                            .dwattr $C$DW$745, DW_AT_decl_line(0xba)
    8405                            .dwattr $C$DW$745, DW_AT_decl_column(0x05)
    8406                    
    8407                            .dwattr $C$DW$T$608, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8408                            .dwattr $C$DW$T$608, DW_AT_decl_line(0xad)
    8409                            .dwattr $C$DW$T$608, DW_AT_decl_column(0x0e)
    8410                            .dwendtag $C$DW$T$608
    8411                    
    8412                    $C$DW$T$609     .dwtag  DW_TAG_typedef
    8413                            .dwattr $C$DW$T$609, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
TI ARM Assembler PC v18.1.4 Wed Dec 12 18:32:41 2018

Tools Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\DAMIAN\AppData\Local\Temp\{7491C7A3-CB92-4437-A790-AF4273D670A8} PAGE  156

    8414                            .dwattr $C$DW$T$609, DW_AT_type(*$C$DW$T$608)
    8415                            .dwattr $C$DW$T$609, DW_AT_language(DW_LANG_C)
    8416                            .dwattr $C$DW$T$609, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8417                            .dwattr $C$DW$T$609, DW_AT_decl_line(0xbb)
    8418                            .dwattr $C$DW$T$609, DW_AT_decl_column(0x03)
    8419                    
    8420                    
    8421                    $C$DW$T$610     .dwtag  DW_TAG_enumeration_type
    8422                            .dwattr $C$DW$T$610, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    8423                            .dwattr $C$DW$T$610, DW_AT_byte_size(0x01)
    8424                    $C$DW$746       .dwtag  DW_TAG_enumerator
    8425                            .dwattr $C$DW$746, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0")
    8426                            .dwattr $C$DW$746, DW_AT_const_value(0x00)
    8427                            .dwattr $C$DW$746, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8428                            .dwattr $C$DW$746, DW_AT_decl_line(0xa4)
    8429                            .dwattr $C$DW$746, DW_AT_decl_column(0x05)
    8430                    
    8431                    $C$DW$747       .dwtag  DW_TAG_enumerator
    8432                            .dwattr $C$DW$747, DW_AT_name("CC1350_LAUNCHXL_ADCBUFCOUNT")
    8433                            .dwattr $C$DW$747, DW_AT_const_value(0x01)
    8434                            .dwattr $C$DW$747, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8435                            .dwattr $C$DW$747, DW_AT_decl_line(0xa6)
    8436                            .dwattr $C$DW$747, DW_AT_decl_column(0x05)
    8437                    
    8438                            .dwattr $C$DW$T$610, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8439                            .dwattr $C$DW$T$610, DW_AT_decl_line(0xa3)
    8440                            .dwattr $C$DW$T$610, DW_AT_decl_column(0x0e)
    8441                            .dwendtag $C$DW$T$610
    8442                    
    8443                    $C$DW$T$611     .dwtag  DW_TAG_typedef
    8444                            .dwattr $C$DW$T$611, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    8445                            .dwattr $C$DW$T$611, DW_AT_type(*$C$DW$T$610)
    8446                            .dwattr $C$DW$T$611, DW_AT_language(DW_LANG_C)
    8447                            .dwattr $C$DW$T$611, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8448                            .dwattr $C$DW$T$611, DW_AT_decl_line(0xa7)
    8449                            .dwattr $C$DW$T$611, DW_AT_decl_column(0x03)
    8450                    
    8451                    
    8452                    $C$DW$T$612     .dwtag  DW_TAG_enumeration_type
    8453                            .dwattr $C$DW$T$612, DW_AT_name("CC1350_LAUNCHXL_ADCName")
    8454                            .dwattr $C$DW$T$612, DW_AT_byte_size(0x01)
    8455                    $C$DW$748       .dwtag  DW_TAG_enumerator
    8456                            .dwattr $C$DW$748, DW_AT_name("CC1350_LAUNCHXL_ADC0")
    8457                            .dwattr $C$DW$748, DW_AT_const_value(0x00)
    8458                            .dwattr $C$DW$748, DW_AT_decl_file("..\Application\CC1350_LAUNCHXL.h")
    8459                            .dwattr $C$DW$748, DW_AT_decl_line(0xc2)
